[{"name":"@types/node","description":" @types/node is a TypeScript definition file for Node.js. It uses an MIT license. This library is used by TypeScript developers to provide type information for Node.js."},{"name":"react-dom","description":" React-DOM is a package that provides a way for React components to interact with the DOM. It uses an MIT license."},{"name":"react","description":" React is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"eslint","description":" Eslint is a popular JavaScript linter. It uses an MIT license. It is an AST-based pattern checker that helps developers find and fix problems in their code."},{"name":"jest","description":" Jest is a JavaScript testing library. It uses an MIT license. It is fast, easy to use, and has a great API."},{"name":"webpack","description":" Webpack is a JavaScript module bundler. It is used for packing CommonJs/AMD modules for the browser. It allows developers to split their codebase into multiple bundles, which can be loaded on demand. It also supports loaders to preprocess files, such as json, jsx, es7, css, less, and your custom stuff."},{"name":"rxjs","description":" RxJS is a library for reactive programming using observables that enables composition of asynchronous and event-based programs. It uses an Apache-2.0 license."},{"name":"moment","description":" Moment is a popular JavaScript library for working with dates. It uses an MIT license. It can parse, validate, manipulate, and display dates. It is being used by millions of developers worldwide."},{"name":"babel-jest","description":" Babel-jest is a plugin for Jest that uses Babel for transformation. It is released under the MIT license."},{"name":"@babel/preset-react","description":" @babel/preset-react is a Babel preset for all React plugins. It uses an MIT license. This preset is used to transform JSX into JavaScript."},{"name":"prettier","description":" Prettier is an opinionated code formatter that enforces a consistent style across your codebase. It is written in JavaScript and uses an MIT license."},{"name":"typescript","description":" TypeScript is a language for application scale JavaScript development. It is a superset of JavaScript that adds types to JavaScript. TypeScript is being used by millions of developers worldwide."},{"name":"@babel/core","description":" @babel/core is the Babel compiler core. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/jest","description":" @types/jest is a popular TypeScript definition library for Jest. It uses an MIT license. This library is used by many TypeScript developers worldwide."},{"name":"babel-preset-es2015","description":" Babel is a popular JavaScript compiler. This preset includes all of the plugins necessary to compile es2015 code. It uses an MIT license."},{"name":"mocha","description":" Mocha is a simple, flexible, and fun test framework. It is being used by millions of developers worldwide."},{"name":"@babel/preset-env","description":" @babel/preset-env is a Babel preset that allows you to use the latest JavaScript features. It uses an MIT license."},{"name":"@babel/plugin-proposal-class-properties","description":" Babel is a popular JavaScript compiler. This plugin allows Babel to transform static class properties as well as properties declared with the property initializer syntax. It uses an MIT license."},{"name":"@types/react","description":" The @types/react library provides TypeScript definitions for React. This is useful for developers using TypeScript."},{"name":"babel-core","description":" Babel is a popular JavaScript compiler. It uses an MIT license. It is a compiler for JavaScript that is used by millions of developers worldwide."},{"name":"commander","description":" Commander is a complete solution for node.js command-line programs. It provides a declarative, efficient, and flexible way to build programs. It is being used by millions of developers worldwide."},{"name":"fs-extra","description":" fs-extra is a popular library written in JavaScript. It uses an MIT license. It adds extra methods to the fs package that aren't included in the vanilla Node.js fs package. Such as recursive mkdir, copy, and remove. It is being used by millions of developers worldwide."},{"name":"webpack-dev-server","description":" The webpack-dev-server is a popular library written in JavaScript. It uses an MIT license. It's a simple and efficient way to serve a webpack app. It updates the browser on changes."},{"name":"chalk","description":" Chalk is a terminal string styling library written in JavaScript. It uses an MIT license. It is a popular library used by millions of developers worldwide."},{"name":"vue-template-compiler","description":" Vue-template-compiler is a template compiler for Vue 2.0. It uses an MIT license. It is a tool that allows developers to compile Vue templates into JavaScript render functions."},{"name":"babel-preset-react","description":" Babel preset for all React plugins. It uses an MIT license. This preset includes all the plugins that are necessary for React to work."},{"name":"@typescript-eslint/parser","description":" @typescript-eslint/parser is a custom parser for ESLint which leverages TypeScript ESTree. It uses a BSD-2-Clause license. It is being used by millions of developers worldwide."},{"name":"lodash","description":" Lodash is a JavaScript library that provides utility functions for working with arrays, objects, and strings. It uses an MIT license."},{"name":"babel-loader","description":" babel-loader is a webpack loader that allows you to use Babel to transpile JavaScript files. It uses an MIT license."},{"name":"autoprefixer","description":" Autoprefixer is a popular tool written in JavaScript. It uses an MIT license. It parses CSS and adds vendor prefixes to CSS rules using values from the Can I Use website. It is being used by millions of developers worldwide."},{"name":"gulp","description":" Gulp is a streaming build system written in JavaScript. It uses an MIT license. It's a fast, powerful, and easy-to-use build system that makes it easy to create and automate tasks."},{"name":"@typescript-eslint/eslint-plugin","description":" This plugin allows TypeScript to be used with ESLint. It uses an MIT license. It is a popular plugin that is used by many developers."},{"name":"css-loader","description":" css-loader is a popular module written in JavaScript. It uses an MIT license. It's a module for webpack that allows you to load CSS files. It is being used by millions of developers worldwide."},{"name":"async","description":" Async is a utility module that provides higher-order functions and common patterns for asynchronous code. It is licensed under the MIT license."},{"name":"express","description":" Express is a popular web framework written in JavaScript. It uses an MIT license. It is fast, unopinionated, and minimalist. It is being used by millions of developers worldwide."},{"name":"core-js","description":" Core-js is a standard library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"eslint-config-airbnb","description":" This package provides Airbnb's .eslintrc as an extensible shared config."},{"name":"eslint-plugin-import","description":" eslint-plugin-import is a plugin for ESLint that helps lint your code for errors related to imports. It uses an MIT license."},{"name":"chai","description":" Chai is a popular assertion library written in JavaScript. It uses an MIT license. It is test framework agnostic and can be used with any test framework."},{"name":"debug","description":" Debug is a lightweight debugging utility for Node.js and the browser. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"karma","description":" Karma is a popular test runner written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"sinon","description":" Sinon is a popular library written in JavaScript. It uses a BSD-3-Clause license. It's a library for test spies, stubs and mocks. It is being used by millions of developers worldwide."},{"name":"husky","description":" Husky is a modern tool for managing Git hooks. It is written in JavaScript and uses an MIT license. Husky is easy to use and makes it easy to manage Git hooks."},{"name":"node-sass","description":" Node-sass is a popular library written in JavaScript. It uses an MIT license. It's a wrapper around libsass, which is a library for Sass, a popular CSS pre-processor. It is being used by millions of developers worldwide."},{"name":"postcss-loader","description":" postcss-loader is a loader for webpack that allows you to use PostCSS in your webpack projects. It uses an MIT license."},{"name":"@babel/runtime","description":" @babel/runtime is a popular library written in JavaScript. It uses an MIT license. It is a modular runtime helper for Babel. It is being used by millions of developers worldwide."},{"name":"axios","description":" Axios is a promise-based HTTP client that works in the browser and Node.js. It uses an MIT license. It has a small footprint and is easy to use."},{"name":"glob","description":" Glob is a little globber written in JavaScript. It uses an ISC license. It's a simple and easy to use library for matching file paths."},{"name":"rollup","description":" Rollup is a next-generation ES module bundler. It uses an MIT license. It is able to create small bundles and has tree-shaking capabilities. It is being used by many developers to create JavaScript modules."},{"name":"@babel/plugin-proposal-decorators","description":" This Babel plugin transforms class and object decorators to ES5. It uses an MIT license."},{"name":"@types/glob","description":" @types/glob is a library that provides TypeScript definitions for Glob. Glob is a popular JavaScript library that is used for pattern matching."},{"name":"html-webpack-plugin","description":" The html-webpack-plugin simplifies creation of HTML files to serve your webpack bundles. It can generate a script or link tag for each entrypoint. It also supports on-demand loading of bundles."},{"name":"eslint-config-prettier","description":" This is a configuration for the ESLint code linter that turns off all rules that are unnecessary or might conflict with Prettier. It uses an MIT license."},{"name":"@babel/plugin-transform-react-jsx","description":" This Babel plugin transforms JSX into React function calls. It uses an MIT license."},{"name":"@babel/plugin-proposal-object-rest-spread","description":" This Babel plugin transforms object rest and spread to ES5. It is being used by millions of developers worldwide."},{"name":"@angular/core","description":" Angular is a popular framework written in TypeScript. It uses an MIT license. It's a declarative, efficient, and flexible framework for building web applications. It is being used by millions of developers worldwide."},{"name":"@angular/compiler","description":" The Angular compiler library is used for compiling Angular applications. It uses an MIT license."},{"name":"sass-loader","description":" Sass loader for webpack. It uses an MIT license. It's a popular library written in JavaScript. It is being used by millions of developers worldwide."},{"name":"expect","description":" Expect is a JavaScript library that provides an `expect` function for use with Jest. It is released under an MIT license."},{"name":"@types/react-dom","description":" The @types/react-dom package provides type definitions for React (react-dom). It uses an MIT license."},{"name":"tslib","description":" tslib is a runtime library for TypeScript helper functions. It is licensed under the 0BSD license."},{"name":"grunt","description":" Grunt is a popular task runner written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"bootstrap","description":" Bootstrap is a popular front-end framework. It uses an MIT license. It is mobile first and responsive. It is being used by millions of developers worldwide."},{"name":"react-router-dom","description":" React Router DOM is a declarative routing library for React web applications. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@angular/common","description":" The Angular Common library is a set of commonly needed directives and services. It uses an MIT license."},{"name":"@babel/plugin-transform-modules-commonjs","description":" This plugin transforms ES2015 modules to CommonJS. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-cli","description":" Babel is a JavaScript compiler. It is used to convert code written in one language to another. The Babel command line interface allows you to compile code from the command line."},{"name":"babel-plugin-transform-object-rest-spread","description":" Babel is a popular JavaScript compiler. This plugin transforms object rest and spread to ES5. It is being used by millions of developers worldwide."},{"name":"babel-preset-stage-0","description":" Babel preset for stage 0 plugins. It uses an MIT license."},{"name":"react-is","description":" React is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide. React-is is a brand checking utility for React elements."},{"name":"@types/mocha","description":" @types/mocha is a TypeScript definition file for the popular JavaScript testing library Mocha. It uses an MIT license. This definition file allows TypeScript developers to use Mocha in their TypeScript projects."},{"name":"redux","description":" Redux is a predictable state container for JavaScript apps. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"lint-staged","description":" lint-staged is a tool that allows you to lint your files before you commit them. It is written in JavaScript and uses an MIT license."},{"name":"prop-types","description":" prop-types is a popular library written in JavaScript. It uses an MIT license. It is a runtime type checking library for React props and similar objects. It is being used by millions of developers worldwide."},{"name":"@babel/cli","description":" @babel/cli is a command line interface for Babel. It uses an MIT license. It is a popular tool used by developers to transpile JavaScript code."},{"name":"jest-cli","description":" Jest is a JavaScript testing library. It uses an MIT license. Jest is a delightful JavaScript testing library. It is being used by millions of developers worldwide."},{"name":"rimraf","description":" Rimraf is a deep deletion module for node that is similar to the Unix command `rm -rf`. It is published under an ISC license."},{"name":"eslint-plugin-react","description":" This plugin provides React specific linting rules for ESLint. It uses an MIT license. It helps to keep your code consistent and error-free."},{"name":"babel-plugin-transform-runtime","description":" Babel is a JavaScript compiler. This plugin is a Babel plugin that externalizes references to helpers and builtins, automatically polyfilling your code without polluting globals."},{"name":"@types/yargs","description":" @types/yargs is a TypeScript definition file for yargs. It uses an MIT license."},{"name":"minimist","description":" A minimalistic option parser that supports short and long flags, subcommands, and positional arguments. It is used by many popular projects, such as Express."},{"name":"cross-env","description":" Cross-env is a popular library written in JavaScript. It uses an MIT license. It is a tool that allows you to run scripts that set and use environment variables across platforms."},{"name":"@babel/plugin-transform-runtime","description":" @babel/plugin-transform-runtime is a popular Babel plugin written in JavaScript. It uses an MIT license. It is a plugin that externalises references to helpers and builtins, automatically polyfilling your code without polluting globals. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-numeric-separator","description":" Babel is a popular JavaScript compiler. This plugin removes numeric separators from Decimal, Binary, Hex and Octal literals."},{"name":"acorn","description":" Acorn is a JavaScript parser written in JavaScript. It uses an MIT license. It is a tool for parsing ECMAScript code."},{"name":"tape","description":" Tape is a popular test harness written in JavaScript. It uses an MIT license. It is used for testing Node.js and browser applications."},{"name":"@angular/animations","description":" Angular animations is a popular library written in JavaScript. It uses an MIT license. It's a library for building animations."},{"name":"@angular/platform-browser","description":" Angular is a popular library written in TypeScript. It uses an MIT license. It is used for building single-page web applications. It is being used by millions of developers worldwide."},{"name":"ts-node","description":" ts-node is a popular library written in TypeScript. It uses an MIT license. It's an execution environment and REPL for node.js, with source map support. It is being used by millions of developers worldwide."},{"name":"socket.io","description":" Socket.IO is a popular JavaScript library that provides real-time communication between web clients and servers. It uses an MIT license."},{"name":"@angular/animations","description":" Angular - animations integration with web-animations. Angular is a popular framework written in TypeScript. It uses an MIT license. Angular - animations integration with web-animations enables developers to create animations which are consistent across all browsers."},{"name":"ajv","description":" AJV is a JSON Schema validator that uses an MIT license. It is a fast and flexible validator that is used by millions of developers worldwide."},{"name":"react-app-polyfill","description":" React App Polyfill is a popular library written in JavaScript. It uses an MIT license. It's a library for various browsers including commonly used language features. It is being used by millions of developers worldwide."},{"name":"http-proxy-middleware","description":" This is a one-line node.js proxy middleware for connect, express and browser-sync. It uses an MIT license."},{"name":"inquirer","description":" Inquirer is a collection of common interactive command line user interfaces. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/code-frame","description":" Babel is a popular JavaScript compiler written in JavaScript. It uses an MIT license. @babel/code-frame is a plugin that generates errors that contain a code frame that points to source locations."},{"name":"babel-preset-react-app","description":" Babel preset used by Create React App"},{"name":"style-loader","description":" The style-loader is a module for webpack that allows you to load CSS files into your application. It uses an MIT license."},{"name":"eslint-config-standard","description":" eslint-config-standard is a popular JavaScript style guide. It uses an MIT license. It's a shareable config for ESLint. It is being used by millions of developers worldwide."},{"name":"@babel/preset-typescript","description":" @babel/preset-typescript is a Babel preset for TypeScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"tslint","description":" TSLint is an extensible static analysis linter for the TypeScript language. It uses an Apache-2.0 license. TSLint is used by developers to check their TypeScript code for errors."},{"name":"uuid","description":" uuid is a JavaScript library that generates RFC4122 (v1, v4, and v5) UUIDs. It uses an MIT license."},{"name":"@babel/plugin-proposal-nullish-coalescing-operator","description":" This plugin removes the nullish coalescing operator from JavaScript. It uses an MIT license."},{"name":"react-router","description":" React Router is a popular library written in JavaScript. It uses an MIT license. It's a declarative routing library for React. It is being used by millions of developers worldwide."},{"name":"@angular/language-service","description":" The Angular language service provides language services that can be used in Angular applications. The language service is provided as a npm package and can be used in any Angular application. The language service provides language services that can be used in Angular applications. The language service is provided as a npm package and can be used in any Angular application."},{"name":"@angular/compiler-cli","description":" The Angular compiler CLI for Node.js is an MIT-licensed open source project. It is a popular tool for building Angular applications."},{"name":"@angular/router","description":" The Angular Router library provides routing and navigation for Angular applications. The library is written in TypeScript and uses an MIT license."},{"name":"jest-resolve","description":" Jest is a JavaScript testing library. Jest-resolve is a library that helps Jest to resolve modules. It is being used by millions of developers worldwide."},{"name":"lru-cache","description":" LRU Cache is a cache object that deletes the least-recently-used items. It is open source software and is released under the ISC license."},{"name":"babel-register","description":" Babel is a JavaScript compiler. This require hook will enable the use of Babel's require hook. This will allow you to use Babel's require hook to compile your code on the fly."},{"name":"react-test-renderer","description":" React Test Renderer is a package that allows you to create snapshot tests for React components. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/lodash","description":" @types/lodash is a library that provides TypeScript definitions for Lo-Dash. Lo-Dash is a popular JavaScript library that provides utility functions for working with arrays, objects, and strings."},{"name":"react-scripts","description":" React-scripts is a configuration and script library for Create React App. It uses an MIT license. It helps developers create and build React applications."},{"name":"chokidar","description":" Chokidar is a minimal and efficient cross-platform file watching library. It is being used by millions of developers worldwide."},{"name":"karma-chrome-launcher","description":" Karma is a popular test runner written in JavaScript. It uses an MIT license. This plugin is a launcher for Chrome and Chrome Canary."},{"name":"eslint-config-airbnb-base","description":" eslint-config-airbnb-base is a popular JavaScript style guide. It uses an MIT license."},{"name":"@babel/plugin-proposal-optional-chaining","description":" This Babel plugin transforms optional chaining operators into a series of nil checks. It is useful for code that needs to support older versions of JavaScript. It is released under the MIT license."},{"name":"ws","description":" WS is a simple to use, blazing fast, and thoroughly tested websocket client and server for Node.js. It is MIT licensed."},{"name":"webpack-cli","description":" webpack-cli is a popular CLI tool for webpack. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"ts-jest","description":" ts-jest is a Jest transformer with source map support that lets you use Jest to test projects written in TypeScript. It is being used by millions of developers worldwide."},{"name":"@angular/platform-browser-dynamic","description":" Angular is a popular library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"eslint-plugin-react-hooks","description":" This is an ESLint plugin that provides rules for React Hooks. It uses an MIT license."},{"name":"babel-runtime","description":" Babel is a popular JavaScript library that allows developers to write code that is compatible with different browsers. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-modules-commonjs","description":" This is a Babel plugin that transforms ES2015 modules to CommonJS. It uses an MIT license."},{"name":"react-dev-utils","description":" React Dev Utils is a set of webpack utilities used by Create React App. It uses an MIT license. It helps developers build interfaces faster and more efficiently."},{"name":"@babel/plugin-proposal-export-namespace-from","description":" Babel is a JavaScript compiler. This plugin allows you to compile export namespace to ES2015. It uses an MIT license."},{"name":"qs","description":" qs is a querystring parser that supports nesting and arrays, with a depth limit. It is licensed under the BSD-3-Clause license."},{"name":"@babel/plugin-syntax-dynamic-import","description":" @babel/plugin-syntax-dynamic-import is a Babel plugin that allows parsing of import(). It uses an MIT license."},{"name":"angular","description":" Angular is a popular framework written in JavaScript. It uses an MIT license. It is used for building web applications. It is being used by millions of developers worldwide."},{"name":"uglify-js","description":" UglifyJS is a JavaScript parser, mangler/compressor and beautifier toolkit. It is released under the BSD-2-Clause license. It is being used by millions of developers worldwide."},{"name":"@angular/forms","description":" The Angular Forms library provides directives and services for creating forms. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"date-fns","description":" date-fns is a modern JavaScript date utility library. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"path-to-regexp","description":" Path-to-regexp is a popular utility written in JavaScript that allows you to convert a path string to a regular expression. It uses an MIT license."},{"name":"babel-plugin-transform-async-to-generator","description":" Babel is a popular JavaScript transpiler. This plugin turns async functions into ES2015 generators. It uses an MIT license."},{"name":"babel-plugin-syntax-jsx","description":" Babel plugin that allows parsing of JSX. It uses an MIT license."},{"name":"vue","description":" Vue is a popular framework written in JavaScript. It uses an MIT license. It's a progressive framework for building modern web UI. It is being used by millions of developers worldwide."},{"name":"@types/jasmine","description":" @types/jasmine is a popular TypeScript definitions library for Jasmine. It uses an MIT license. It provides type definitions for Jasmine so that TypeScript can be used to write Jasmine tests."},{"name":"eslint-config-react-app","description":" This is an ESLint configuration used by Create React App. It uses an MIT license."},{"name":"babel-preset-env","description":" Babel preset for each environment. It uses an MIT license. It's a popular preset used by many developers."},{"name":"readable-stream","description":" readable-stream is a user-land copy of the stream library from Node.js. It is licensed under the MIT license."},{"name":"nan","description":" Nan is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"q","description":" Q is a popular library for promises. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"jasmine-core","description":" Jasmine is a popular testing framework written in JavaScript. It uses an MIT license. It's a simple testing framework for browsers and node.js. It is being used by millions of developers worldwide."},{"name":"eslint-plugin-jsx-a11y","description":" This plugin checks JSX elements for accessibility rules. It uses an MIT license."},{"name":"lodash.camelcase","description":" Lodash is a popular utility library written in JavaScript. It uses an MIT license. The lodash method `_.camelCase` is exported as a module. It is being used by millions of developers worldwide."},{"name":"@babel/preset-flow","description":" Babel preset for all Flow plugins. Flow is a static type checker for JavaScript. This preset includes all the plugins that are necessary to transform Flow code into vanilla JavaScript."},{"name":"underscore","description":" Underscore is a popular JavaScript library that provides functional programming helpers. It is being used by millions of developers worldwide. It is released under the MIT license."},{"name":"@babel/plugin-transform-destructuring","description":" This Babel plugin transforms destructuring assignments to ES5. It is licensed under the MIT license."},{"name":"@types/json-schema","description":" @types/json-schema provides TypeScript definitions for json-schema 4.0, 6.0 and 7.0. It is MIT licensed."},{"name":"@types/chai","description":" @types/chai is a TypeScript definition file for the chai library. It uses an MIT license."},{"name":"@babel/plugin-transform-parameters","description":" Babel is a popular JavaScript compiler. This plugin transforms ES2015 default and rest parameters to ES5. It uses an MIT license."},{"name":"@angular/platform-server","description":" @angular/platform-server is an Angular library that allows you to use Angular in Node.js. It uses an MIT license."},{"name":"mongodb","description":" MongoDB is a powerful database system. It is used by millions of developers worldwide. The official MongoDB driver for Node.js is licensed under the Apache-2.0 license."},{"name":"@types/chai","description":" @types/chai is a TypeScript definition file for the chai library. It uses an MIT license."},{"name":"@types/json-schema","description":" The @types/json-schema library provides TypeScript definitions for json-schema 4.0, 6.0 and 7.0. It uses an MIT license."},{"name":"@babel/plugin-proposal-json-strings","description":" @babel/plugin-proposal-json-strings is a Babel plugin that escapes U+2028 LINE SEPARATOR and U+2029 PARAGRAPH SEPARATOR in JS strings. It is released under the MIT license."},{"name":"@babel/preset-flow","description":" Babel preset for all Flow plugins. Flow is a static type checker for JavaScript. This preset includes all the plugins that are necessary for Flow to work."},{"name":"@babel/plugin-transform-destructuring","description":" Babel is a popular JavaScript compiler. This plugin allows you to compile ES2015 destructuring to ES5. It uses an MIT license."},{"name":"babel-generator","description":" Babel is a popular JavaScript library that is used to generate code from an AST. It uses an MIT license."},{"name":"babel-preset-flow","description":" Babel preset for all Flow plugins. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-flow-strip-types","description":" Babel is a popular JavaScript compiler. This plugin strips flow type annotations from your output code."},{"name":"babel-plugin-transform-class-properties","description":" Babel is a popular JavaScript compiler. This plugin is a Babel plugin that transforms static class properties as well as properties declared with the property initializer syntax. It is being used by millions of developers worldwide."},{"name":"babel-preset-stage-2","description":" Babel preset for stage 2 plugins. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-preset-stage-3","description":" Babel preset for stage 3 plugins. It uses an MIT license. It's a popular library written in JavaScript. It enables developers to use JavaScript to write code that can be compiled to run on different platforms."},{"name":"@storybook/addons","description":" The @storybook/addons library is a collection of addons for the popular JavaScript library, Storybook. These addons extend the functionality of Storybook and make it even more powerful. The library is released under the MIT license."},{"name":"@types/sinon","description":" @types/sinon is a library that provides TypeScript definitions for Sinon. It uses an MIT license. It is a popular library used by millions of developers worldwide."},{"name":"@types/express","description":" @types/express is a TypeScript definition file for Express. It uses an MIT license. Express is a popular web framework written in JavaScript. It is being used by millions of developers worldwide."},{"name":"babel-plugin-named-asset-import","description":" Babel plugin for named asset imports in Create React App. It uses an MIT license."},{"name":"connect-history-api-fallback","description":" Connect-history-api-fallback is a middleware for connect and express. It provides a fallback for non-existing directories so that the HTML 5 history API can be used. It is being used by millions of developers worldwide."},{"name":"del","description":" Del is a command line utility that allows you to delete files and directories. It is released under the MIT license."},{"name":"babel-eslint","description":" Babel-eslint is a custom parser for ESLint. It uses an MIT license. Babel-eslint allows you to lint all valid Babel code with the ESLint."},{"name":"camelcase","description":" Camelcase is a popular library written in JavaScript. It uses an MIT license. It's a simple utility for converting a dash/dot/underscore/space separated string to camelCase or PascalCase."},{"name":"semver","description":" Semver is a popular semantic version parser used by npm. It is released under the ISC license."},{"name":"immutable","description":" Immutable is a data structure library written in JavaScript that provides an immutable data structure that can be used to efficiently manage data collections. It is being used by millions of developers worldwide."},{"name":"zone.js","description":" Zone.js is a JavaScript library that provides a way to create zones in JavaScript. Zone.js is open source and released under the MIT license."},{"name":"cssnano","description":" cssnano is a popular minifier written in JavaScript. It uses an MIT license. It is a modular minifier, built on top of the PostCSS ecosystem. It is being used by millions of developers worldwide."},{"name":"@babel/helper-module-imports","description":" @babel/helper-module-imports is a helper module that helps with inserting module loads. It uses an MIT license."},{"name":"@babel/plugin-transform-modules-umd","description":" This Babel plugin transforms ES2015 modules to UMD. It uses an MIT license."},{"name":"highlight.js","description":" highlight.js is a syntax highlighter written in JavaScript. It uses the BSD-3-Clause license. It supports over 170 languages and can automatically detect the language of a code block."},{"name":"jest-mock","description":" Jest is a JavaScript testing library. It uses an MIT license. Jest-mock is a library for mocking JavaScript functions."},{"name":"jest-mock","description":" Jest is a JavaScript testing framework. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"jest-environment-node","description":" Jest is a popular testing library written in JavaScript. It uses an MIT license. Jest-environment-node is a library that allows you to run Jest tests in a Node environment."},{"name":"@babel/parser","description":" Babel is a popular JavaScript transpiler. It uses an MIT license. @babel/parser is a JavaScript parser used by Babel. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-async-to-generator","description":" This Babel plugin turns async functions into ES2015 generators. This is useful for code that needs to be compatible with older versions of JavaScript. The plugin is released under an MIT license."},{"name":"marked","description":" Marked is a markdown parser built for speed. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"resolve","description":" Resolve is a popular library written in JavaScript. It uses an MIT license. It is used to resolve files asynchronously and synchronously. It is being used by millions of developers worldwide."},{"name":"@storybook/addon-actions","description":" @storybook/addon-actions is a popular library written in JavaScript. It uses an MIT license. It's a library that provides UI feedback when an action is performed on an interactive element. It is being used by millions of developers worldwide."},{"name":"@storybook/react","description":" @storybook/react is a popular library for developing React components in isolation with Hot Reloading. It uses an MIT license."},{"name":"jquery","description":" jQuery is a JavaScript library that makes DOM operations easy. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/enzyme","description":" Enzyme is a JavaScript library used for testing React components. @types/enzyme provides type definitions for Enzyme so that it can be used with TypeScript. It is licensed under the MIT license."},{"name":"@types/uuid","description":" @types/uuid is a TypeScript definition file for the uuid library. It uses an MIT license."},{"name":"coveralls","description":" Coveralls is a simple and popular tool for taking json-cov output and POSTing it to coveralls.io. It uses a BSD-2-Clause license."},{"name":"co","description":" CO is a generator based control flow goodness for nodejs and the browser, using promises, letting you write non-blocking code in a nice-ish way."},{"name":"js-yaml","description":" JS-YAML is a YAML 1.2 parser and serializer written in JavaScript. It is released under the MIT license."},{"name":"socket.io-client","description":" Socket.IO enables real-time bidirectional event-based communication. It works on every platform, browser or device, focusing equally on reliability and speed."},{"name":"url-loader","description":" The url-loader is a webpack loader which transforms files into base64 URIs. It is being used by millions of developers worldwide."},{"name":"ejs","description":" EJS is a popular JavaScript templating engine. It uses an Apache-2.0 license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-react-display-name","description":" This plugin adds a displayName property to React.createClass calls. This makes it easier to debug React components in the browser."},{"name":"standard","description":" Standard is a JavaScript style guide, linter, and formatter. It is used by millions of developers worldwide."},{"name":"winston","description":" Winston is a logger for just about everything. It is very popular and used by millions of developers worldwide. It has an MIT license."},{"name":"@babel/plugin-proposal-throw-expressions","description":" @babel/plugin-proposal-throw-expressions is a plugin for Babel that wraps Throw Expressions in an IIFE. This is a useful tool for developers who want to use Babel to transpile their code for older browsers that do not support throw expressions. The plugin is released under an MIT license."},{"name":"minimatch","description":" Minimatch is a popular library written in JavaScript. It uses an ISC license. It's a glob matcher in javascript."},{"name":"@babel/plugin-transform-regenerator","description":" Babel is a popular tool written in JavaScript. It uses an MIT license. It's a plugin that allows you to transform async and generator functions into a state machine. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-optional-catch-binding","description":" @babel/plugin-proposal-optional-catch-binding is a Babel plugin that compiles optional catch bindings. It uses an MIT license."},{"name":"@babel/plugin-transform-arrow-functions","description":" This Babel plugin transforms ES2015 arrow functions to ES5. It uses an MIT license."},{"name":"jest-haste-map","description":" Jest is a JavaScript testing library. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/register","description":" @babel/register is a require hook that allows you to use Babel in your node.js application. It uses an MIT license."},{"name":"babel","description":" Babel is a JavaScript compiler written in JavaScript. It uses an MIT license. It is a popular tool used by developers to turn ES6 code into readable vanilla ES5 code with source maps."},{"name":"jest-environment-jsdom","description":" Jest is a JavaScript testing library. It uses an MIT license. Jest is a JavaScript testing library that provides a way to test JavaScript applications."},{"name":"@storybook/addon-links","description":" @storybook/addon-links is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"mini-css-extract-plugin","description":" The mini-css-extract-plugin is a popular webpack plugin that extracts CSS into separate files. It uses an MIT license."},{"name":"serve-static","description":" Serve static files such as images, CSS, and JavaScript from a directory on your Node.js server."},{"name":"nyc","description":" nyc is a command line interface for Istanbul, a JavaScript code coverage tool. It is released under the ISC license."},{"name":"lodash.get","description":" Lodash is a popular JavaScript utility library. The lodash method `_.get` is exported as a module. It is used to get the value at the specified path of an object."},{"name":"eslint-plugin-prettier","description":" This plugin runs prettier as an eslint rule. It is released under the MIT license."},{"name":"mime-types","description":" mime-types is a popular library written in JavaScript. It uses an MIT license. It is a comprehensive library for working with content-types."},{"name":"eslint-plugin-promise","description":" eslint-plugin-promise is a plugin for the popular linting tool ESLint. It enforces best practices for JavaScript promises, making sure that they are properly handled. It is released under the ISC license."},{"name":"ora","description":" Ora is a popular terminal spinner written in JavaScript. It uses an MIT license. It is a elegant and lightweight library that makes it easy to add terminal spinners to your Node.js applications."},{"name":"@types/babel__traverse","description":" @types/babel__traverse is a TypeScript definition file for @babel/traverse. @babel/traverse is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"@angular/cli","description":" @angular/cli is a CLI tool for Angular. It uses an MIT license. It is a tool for developers to create and manage Angular applications."},{"name":"body-parser","description":" Body-parser is a Node.js body-parsing middleware. It uses an MIT license. It is a popular library used by millions of developers worldwide."},{"name":"node-fetch","description":" A light-weight module that brings the Fetch API to node.js. It is being used by millions of developers worldwide."},{"name":"@babel/helper-plugin-utils","description":" @babel/helper-plugin-utils is a utility library for plugins to use. It provides general utilities such as a function for creating plugin helpers. It is released under the MIT license."},{"name":"@babel/template","description":" Babel is a popular JavaScript compiler written in JavaScript. It uses an MIT license. It can generate an AST from a string template."},{"name":"babylon","description":" Babylon is a JavaScript parser written in JavaScript. It uses an MIT license. It is a popular library used by millions of developers worldwide."},{"name":"babel-plugin-transform-object-assign","description":" Babel is a popular tool that helps developers write code that is compatible with different browsers. This plugin helps to replace Object.assign with an inline helper."},{"name":"babel-plugin-syntax-object-rest-spread","description":" This Babel plugin allows parsing of object rest/spread. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-preset-stage-1","description":" Babel preset for stage 1 plugins. It uses an MIT license. It's a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"electron","description":" Electron is a popular framework written in JavaScript. It uses an MIT license. It allows developers to build cross platform desktop apps with JavaScript, HTML, and CSS. It is being used by millions of developers worldwide."},{"name":"@types/jquery","description":" @types/jquery is a library that provides TypeScript definitions for jquery. It uses an MIT license."},{"name":"globby","description":" Globby is a user-friendly glob matching library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"istanbul","description":" istanbul is a code coverage tool that computes statement, line, function and branch coverage with module loader hooks to transparently add coverage when running tests. It is licensed under the BSD-3-Clause license."},{"name":"node-notifier","description":" node-notifier is a Node.js module that allows you to send notifications on native Mac, Windows (post and pre 8) and Linux (or Growl as fallback). It is released under the MIT license."},{"name":"@babel/plugin-syntax-jsx","description":" Babel is a popular JavaScript compiler. This plugin allows parsing of JSX. It is being used by millions of developers worldwide."},{"name":"bluebird","description":" Bluebird is a full featured Promises/A+ implementation with exceptionally good performance. It uses an MIT license. Bluebird is used by millions of developers worldwide."},{"name":"browser-sync","description":" Browser Sync is a live CSS reload and browser syncing tool. It uses an Apache-2.0 license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-export-default-from","description":" @babel/plugin-proposal-export-default-from is a Babel plugin that compiles export default to ES2015. It uses an MIT license."},{"name":"execa","description":" Execa is a process execution library for Node.js. It uses an MIT license. It is a human-friendly library for running processes. It is being used by millions of developers worldwide."},{"name":"lodash.merge","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The Lodash method `_.merge` is exported as a module. It is used to merge two objects together."},{"name":"webpack-dev-middleware","description":" webpack-dev-middleware is a development middleware for webpack. It uses an MIT license. It's a simple, efficient way to develop webpack-based projects."},{"name":"babel-preset-jest","description":" Babel preset for all Jest plugins. This preset is automatically included when using babel-jest. It uses an MIT license."},{"name":"yargs","description":" yargs is a popular library written in JavaScript. It uses an MIT license. It is a modern, pirate-themed, successor to optimist. It is being used by millions of developers worldwide."},{"name":"react-addons-test-utils","description":" The React TestUtils add-on provides a way to test React components. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-async-generator-functions","description":" This Babel plugin turns async generator functions into ES2015 generators. This is useful for writing asynchronous code that is compatible with older JavaScript engines."},{"name":"@types/babel__core","description":" @types/babel__core is a library that provides TypeScript definitions for @babel/core. This library is released under the MIT license."},{"name":"@types/jasminewd2","description":" @types/jasminewd2 is a TypeScript definition file for the jasminewd2 library. It uses an MIT license."},{"name":"@angular-devkit/build-angular","description":" Angular Devkit Build Angular is an Angular library that provides a Build Facade for use with the Angular webpack build system. It is released under an MIT license."},{"name":"@babel/traverse","description":" @babel/traverse is a popular module written in JavaScript. It uses an MIT license. It is responsible for replacing, removing, and adding nodes in a tree. It is being used by millions of developers worldwide."},{"name":"@babel/generator","description":" Babel is a popular JavaScript compiler. It uses an MIT license. @babel/generator turns an AST into code."},{"name":"babel-plugin-external-helpers","description":" Babel is a popular JavaScript compiler. This plugin contains helper functions that’ll be placed at the top of the generated code. It uses an MIT license."},{"name":"babel-polyfill","description":" Babel is a JavaScript compiler. It is used to convert code written in one language into another language. The Babel Polyfill provides polyfills necessary for a full ES2015+ environment."},{"name":"babel-plugin-transform-react-jsx","description":" This Babel plugin transforms JSX into React function calls. It uses an MIT license."},{"name":"@babel/plugin-transform-block-scoping","description":" Babel is a popular JavaScript compiler. This plugin transforms ES2015 block scoping (const and let) to ES5. It uses an MIT license."},{"name":"babel-plugin-syntax-dynamic-import","description":" Babel plugin to enable parsing of import(). Allows for dynamic loading of modules at runtime."},{"name":"file-loader","description":" File Loader is a webpack module that allows you to load files into your application. It uses an MIT license."},{"name":"element-ui","description":" Element-UI is a component library for Vue.js. It uses an MIT license. It is a popular library that is used by millions of developers worldwide."},{"name":"enzyme","description":" Enzyme is a popular JavaScript testing utility for React. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"color","description":" Color is a popular color conversion and manipulation library. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"es6-promise","description":" ES6-Promise is a lightweight library that provides tools for organizing asynchronous code. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"history","description":" History is a popular library written in JavaScript. It uses an MIT license. It's a library for managing session history with JavaScript. It is being used by millions of developers worldwide."},{"name":"supertest","description":" Supertest is a popular library written in JavaScript. It uses an MIT license. It's a SuperAgent driven library for testing HTTP servers. It is being used by millions of developers worldwide."},{"name":"extend","description":" Extend is a port of jQuery.extend for node.js and the browser. It is licensed under the MIT license."},{"name":"clone","description":" clone is a utility function for deep cloning of objects and arrays. It is written in JavaScript and uses an MIT license."},{"name":"@babel/plugin-transform-typescript","description":" Babel is a popular JavaScript compiler. This plugin transforms TypeScript into ES.next. It uses an MIT license."},{"name":"meow","description":" Meow is a command line application helper written in JavaScript. It is released under the MIT license."},{"name":"react-bootstrap","description":" React-Bootstrap is a library of Bootstrap 5 components built with React. It is being used by millions of developers worldwide."},{"name":"vue-loader","description":" Vue-loader is a webpack loader for Vue Single-File Components. It uses an MIT license. It allows you to write your components in a format that is easy to maintain and read."},{"name":"@angular/http","description":" Angular is a popular framework written in TypeScript. It uses an MIT license. The http service is a core service that provides Angular with the ability to communicate with backend services."},{"name":"nodemailer","description":" Nodemailer is a popular library written in JavaScript. It uses an MIT license. It's easy as cake e-mail sending from your Node.js applications. It is being used by millions of developers worldwide."},{"name":"echarts","description":" ECharts is a powerful, interactive charting and data visualization library written in JavaScript. It uses an Apache-2.0 license. It is being used by millions of developers worldwide."},{"name":"@babel/node","description":" Babel is a popular JavaScript library that allows developers to write code that is compatible with different browsers. The @babel/node command line tool allows developers to use Babel to write code that can be run on Node.js."},{"name":"csso","description":" csso is a CSS minifier with structural optimizations. It is being used by millions of developers worldwide."},{"name":"npm","description":" npm is a package manager for JavaScript. It is being used by millions of developers worldwide."},{"name":"@types/debug","description":" @types/debug is a library that provides TypeScript definitions for debug. It is released under the MIT license."},{"name":"jest-each","description":" Jest-each is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"bower","description":" Bower is a popular package manager written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-es2015-arrow-functions","description":" Babel is a JavaScript compiler. This plugin transforms ES2015 arrow functions to ES5. It uses an MIT license."},{"name":"babel-plugin-syntax-trailing-function-commas","description":" Babel-plugin-syntax-trailing-function-commas is a plugin for Babel that allows you to compile trailing function commas to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-typeof-symbol","description":" Babel is a popular JavaScript library that uses an MIT license. This plugin is a transformer that wraps all typeof expressions with a method that replicates native behaviour. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-es2015-classes","description":" This Babel plugin transforms ES2015 classes into ES5. It is useful for projects that need to support older browsers."},{"name":"babel-plugin-transform-es2015-modules-systemjs","description":" Babel is a popular JavaScript transpiler. This plugin allows developers to use SystemJS with Babel."},{"name":"babel-plugin-syntax-async-functions","description":" Babel is a popular JavaScript compiler. This plugin allows parsing of async functions. It uses an MIT license."},{"name":"terser","description":" Terser is a popular JavaScript parser, mangler/compressor and beautifier toolkit for ES6+. It uses a BSD-2-Clause license. It is being used by millions of developers worldwide."},{"name":"antd","description":" Antd is a popular library written in JavaScript. It uses an MIT license. It is a enterprise-class UI design language and React components implementation. It is being used by millions of developers worldwide."},{"name":"dotenv","description":" Dotenv is a popular library written in JavaScript. It uses a BSD-2-Clause license. It's a declarative, efficient, and flexible library for loading environment variables from .env files. It is being used by millions of developers worldwide."},{"name":"@types/q","description":" @types/q is a TypeScript definition file for the Q library. It uses an MIT license."},{"name":"@types/selenium-webdriver","description":" @types/selenium-webdriver is a TypeScript definition file that provides types for Selenium WebDriverJS. It uses an MIT license."},{"name":"react-error-overlay","description":" React Error Overlay is a simple React component for displaying stack frames. It uses an MIT license."},{"name":"eslint-plugin-node","description":" This plugin provides additional rules for Node.js. It is released under the MIT license."},{"name":"form-data","description":" Form-data is a library that allows you to create readable \"multipart/form-data\" streams. It can be used to submit forms and file uploads to other web applications. It is released under the MIT license."},{"name":"cors","description":" The cors middleware for Node.js is a popular library that allows you to easily add CORS headers to your Node.js application. It is released under the MIT license."},{"name":"clean-css","description":" clean-css is a popular CSS minifier written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"express-session","description":" Express Session is a simple session middleware for Express. It uses an MIT license. It is a small middleware that provides session management for Express. It is being used by millions of developers worldwide."},{"name":"events","description":" Events is a popular library written in JavaScript. It uses an MIT license. It's a node's event emitter for all engines. It is being used by millions of developers worldwide."},{"name":"loader-utils","description":" loader-utils is a JavaScript library that provides utility functions for working with webpack loaders. It uses an MIT license."},{"name":"big.js","description":" Big.js is a small, fast, easy-to-use library for arbitrary-precision decimal arithmetic. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-flow-strip-types","description":" @babel/plugin-transform-flow-strip-types is a Babel plugin that strips Flow type annotations from your output code. It uses an MIT license."},{"name":"workbox-webpack-plugin","description":" Workbox is a library that provides tools to help you cache and serve files. The workbox-webpack-plugin is a plugin that helps you generate a manifest of local files that workbox-sw should precache."},{"name":"log4js","description":" Log4js is a port of the popular Log4js library to work with node. It is licensed under the Apache-2.0 license."},{"name":"got","description":" Got is a human-friendly and powerful HTTP request library for Node.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"got","description":" Got is a human-friendly and powerful HTTP request library for Node.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"tap","description":" Tap is a popular testing library written in JavaScript. It uses an ISC license. It is a simple and easy to use library that allows you to write tests for your JavaScript code."},{"name":"nodemon","description":" Nodemon is a simple monitor script for use during development of a Node.js app. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-syntax-class-properties","description":" @babel/plugin-syntax-class-properties is a Babel plugin that allows parsing of class properties. It uses an MIT license."},{"name":"sequelize","description":" Sequelize is a promise-based Node.js ORM tool that supports Postgres, MySQL, MariaDB, SQLite, Microsoft SQL Server, Amazon Redshift, and Snowflake's Data Cloud. It uses an MIT license. It features solid transaction support, relations, eager and lazy loading, read replication, and more."},{"name":"puppeteer","description":" Puppeteer is a high-level API to control headless Chrome over the DevTools Protocol. It is licensed under the Apache-2.0 license."},{"name":"jest-diff","description":" Jest-diff is a popular library written in JavaScript. It uses an MIT license. It's a simple library for displaying differences between two values. It is being used by millions of developers worldwide."},{"name":"jest-config","description":" Jest is a JavaScript testing framework. It uses an MIT license. Jest is a popular JavaScript testing framework. It is used by millions of developers worldwide."},{"name":"@vue/cli-plugin-babel","description":" This plugin is a babel plugin for vue-cli. It uses an MIT license. It allows you to use babel with vue-cli."},{"name":"babel-plugin-transform-es2015-sticky-regex","description":" This Babel plugin transforms ES2015 sticky regex into an ES5 RegExp constructor. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-parameters","description":" This plugin transforms ES2015 default and rest parameters to ES5. It is licensed under the MIT license."},{"name":"babel-traverse","description":" The Babel Traverse module is a popular library written in JavaScript. It uses an MIT license. It is responsible for replacing, removing, and adding nodes in a tree."},{"name":"babel-plugin-transform-es2015-destructuring","description":" Babel is a popular JavaScript compiler. This plugin transforms ES2015 destructuring to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-block-scoped-functions","description":" Babel plugin to ensure function declarations at the block level are block scoped. This is useful for preventing errors in code that uses the ES2015 let keyword."},{"name":"babel-plugin-transform-strict-mode","description":" This plugin is a Babel plugin that enables strict mode in all files. It is released under the MIT license."},{"name":"babel-plugin-transform-es2015-duplicate-keys","description":" Babel is a popular JavaScript compiler. This plugin is a Babel plugin that compiles objects with duplicate keys to valid strict ES5. It uses an MIT license."},{"name":"dayjs","description":" Day.js is a popular JavaScript library written in 2KB. It uses an MIT license. It's an immutable date time library alternative to Moment.js with the same modern API. It is being used by millions of developers worldwide."},{"name":"@babel/types","description":" Babel Types is a utility library for AST nodes. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"eslint-plugin-vue","description":" This plugin allows you to lint your Vue.js code using ESLint. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@typescript-eslint/typescript-estree","description":" The @typescript-eslint/typescript-estree parser converts TypeScript source code into an ESTree-compatible form so it can be used with ESLint. It uses a BSD-2-Clause license."},{"name":"copy-webpack-plugin","description":" The CopyWebpackPlugin is a webpack plugin that copies files and directories from one directory to another. It is a simple, efficient, and flexible way to copy files and directories with webpack."},{"name":"@types/inquirer","description":" TypeScript definitions for inquirer, a library for creating command line interfaces. It uses an MIT license."},{"name":"promise","description":" Promise is a bare bones implementation of Promises/A+. It is MIT licensed. It is a small library that is used by many developers."},{"name":"jsdom","description":" Jsdom is a JavaScript implementation of many web standards. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"diff","description":" Diff is a javascript text diff implementation. It uses a BSD-3-Clause license. It is a simple, fast, and easy to use library that is being used by many developers."},{"name":"extract-text-webpack-plugin","description":" This plugin extracts text from a bundle into a file. It uses an MIT license."},{"name":"through","description":" Through is a popular JavaScript module that simplifies stream construction. It is MIT licensed."},{"name":"invariant","description":" Invariant is a JavaScript library that provides a way to check if a given value is valid. It is being used by many developers worldwide."},{"name":"standard-version","description":" Standard-version is a tool for automatically generating CHANGELOG files. It uses an ISC license. It is a replacement for `npm version` with automatic CHANGELOG generation. It is being used by millions of developers worldwide."},{"name":"react-select","description":" React-Select is a Select control built with and for ReactJS. It uses an MIT license. It is a simple, lightweight, and easy to use control."},{"name":"htmlparser2","description":" htmlparser2 is a fast and forgiving HTML/XML parser. It is written in JavaScript and uses an MIT license."},{"name":"@babel/plugin-transform-react-constant-elements","description":" This Babel plugin transforms React JSX elements into value types and hoists them to the highest scope. This is an optimization that can improve performance by reducing calls to React.createElement."},{"name":"bignumber.js","description":" bignumber.js is a popular library written in JavaScript. It uses an MIT license. It's a library for arbitrary-precision decimal and non-decimal arithmetic. It is being used by millions of developers worldwide."},{"name":"vuex","description":" Vuex is a state management library for Vue.js. It uses an MIT license. It is a simple and straightforward library that helps manage state in Vue applications."},{"name":"styled-components","description":" styled-components is a popular library written in JavaScript. It uses an MIT license. It's a library for building visual primitives for the component age. It is being used by millions of developers worldwide."},{"name":"ember-source","description":" Ember is a popular JavaScript framework written in Ember.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"buffer","description":" Buffer is a Node.js API for the browser. It uses an MIT license. It is a fast, efficient, and flexible library for working with buffers."},{"name":"next","description":" Next is a React framework that provides a number of features to make developing React applications easier. Next uses an MIT license."},{"name":"jest-matcher-utils","description":" Jest is a popular test runner written in JavaScript. It uses an MIT license. Jest-matcher-utils is a set of utility functions for expect and related packages. It is being used by millions of developers worldwide."},{"name":"@babel/polyfill","description":" Babel is a popular JavaScript compiler. It uses an MIT license. @babel/polyfill is a Babel plugin that provides polyfills necessary for a full ES2015+ environment."},{"name":"@types/fs-extra","description":" @types/fs-extra is a TypeScript definition file for the popular fs-extra library. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-shorthand-properties","description":" Babel is a JavaScript compiler. This plugin transforms ES2015 shorthand properties to ES5."},{"name":"babel-plugin-transform-es2015-modules-umd","description":" Babel is a popular JavaScript transpiler. This plugin transforms ES2015 modules to UMD. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-computed-properties","description":" Babel is a popular JavaScript compiler. This plugin compiles ES2015 computed properties to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-modules-amd","description":" Babel is a popular JavaScript compiler. This plugin transforms ES2015 modules to AMD. It uses an MIT license."},{"name":"babel-template","description":" Babel is a JavaScript compiler that turns your code into a format that can be run by other JavaScript engines. Babel-template is a Babel plugin that allows you to generate an Abstract Syntax Tree (AST) from a string template."},{"name":"babel-plugin-check-es2015-constants","description":" Babel plugin that compiles ES2015 constants to ES5. It uses an MIT license."},{"name":"react-native","description":" React Native is a framework for building native apps using React. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/minimatch","description":" @types/minimatch is a library that provides type definitions for minimatch. It uses an MIT license."},{"name":"@types/rimraf","description":" @types/rimraf is a TypeScript definition file for the rimraf library. It uses an MIT license."},{"name":"fsevents","description":" fsevents is a native access library written in Objective-C. It is used to monitor file system events on MacOS."},{"name":"classnames","description":" Classnames is a simple utility for conditionally joining classNames together. It is being used by millions of developers worldwide."},{"name":"normalize.css","description":" Normalize.css is a modern alternative to CSS resets. It uses an MIT license. It is a modern, HTML5-ready, CSS reset that provides better cross-browser consistency and improves the default styling of HTML elements."},{"name":"ava","description":" AVA is a popular test runner written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"mime","description":" Mime is a comprehensive library for mime-type mapping. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"d3","description":" D3 is a JavaScript library for manipulating documents based on data. It uses an ISC license. It's a data-driven library that allows developers to create dynamic and interactive visualizations."},{"name":"validator","description":" Validator is a string validation and sanitization library. It uses an MIT license. It is a simple and lightweight library that is very easy to use."},{"name":"whatwg-fetch","description":" whatwg-fetch is a window.fetch polyfill. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"regenerator-runtime","description":" Regenerator is a popular library written in JavaScript. It uses an MIT license. It's a runtime for Regenerator-compiled generator and async functions. It is being used by millions of developers worldwide."},{"name":"ember-cli","description":" Ember CLI is a command line tool written in JavaScript. It is used for developing ambitious ember.js apps. It is licensed under the MIT license."},{"name":"@babel/plugin-syntax-object-rest-spread","description":" Babel is a popular JavaScript compiler. This plugin allows parsing of object rest/spread. It is released under the MIT license."},{"name":"ember-cli","description":" Ember CLI is a command line tool written in JavaScript. It is used for developing ambitious ember.js apps. It is licensed under the MIT license."},{"name":"@types/styled-components","description":" @types/styled-components is a TypeScript definition file for styled-components. It uses an MIT license."},{"name":"@material-ui/core","description":" Material-UI is a set of React components that implement Google's Material Design. It is being used by millions of developers worldwide."},{"name":"@react-native-community/eslint-config","description":" The React Native Community's ESLint config is a popular configuration for React Native projects. It uses an MIT license."},{"name":"pretty-format","description":" Pretty-format is a JavaScript library that stringifies any JavaScript value. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"superagent","description":" Superagent is a popular library written in JavaScript. It uses an MIT license. It's an elegant & feature rich browser / node HTTP with a fluent API. It is being used by millions of developers worldwide."},{"name":"@types/node-fetch","description":" @types/node-fetch is a TypeScript definition file for the node-fetch library. It uses an MIT license."},{"name":"@types/jsonwebtoken","description":" @types/jsonwebtoken is a TypeScript definition file for jsonwebtoken. jsonwebtoken is a popular library for working with JSON Web Tokens. The @types/jsonwebtoken definition file allows TypeScript developers to use jsonwebtoken with type safety."},{"name":"@types/prop-types","description":" @types/prop-types is a TypeScript definition file for the prop-types library. It uses an MIT license."},{"name":"react-transition-group","description":" React Transition Group is a react component toolset for managing animations. It uses a BSD-3-Clause license. It is a simple, powerful, and easy to use toolkit that helps manage animations in react applications."},{"name":"babel-preset-latest","description":" Babel preset including es2015+"},{"name":"babel-plugin-transform-es2015-literals","description":" Babel is a JavaScript compiler. This plugin transforms ES2015 unicode string and number literals to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-object-super","description":" This is a Babel plugin that compiles ES2015 object super to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-for-of","description":" Babel is a popular JavaScript compiler. This plugin allows you to compile ES2015 for...of to ES5."},{"name":"babel-plugin-transform-es2015-spread","description":" Babel is a popular JavaScript compiler. This plugin transforms ES2015 spread to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-block-scoping","description":" Babel is a popular JavaScript compiler written in JavaScript. It uses an MIT license. This plugin transforms ES2015 block scoping (const and let) to ES5."},{"name":"redis","description":" Redis is a fast, open source, in-memory data structure store. It is used as a database, cache, and message broker. Redis is written in ANSI C."},{"name":"babel-code-frame","description":" Babel is a popular JavaScript compiler. Babel-code-frame is a Babel plugin that generates errors that contain a code frame that points to source locations."},{"name":"lerna","description":" Lerna is a tool that helps you manage JavaScript projects with multiple packages. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@fortawesome/fontawesome-svg-core","description":" Font Awesome is a popular font, CSS, and SVG framework. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/classnames","description":" @types/classnames provides its own types definitions for the classnames library. It is licensed under the MIT license."},{"name":"font-awesome","description":" Font Awesome is a popular font and CSS framework. It is used by millions of developers worldwide."},{"name":"confusing-browser-globals","description":" Confusing browser globals is a list of browser globals that are often used by mistake instead of local variables. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-syntax-import-meta","description":" @babel/plugin-syntax-import-meta is a Babel plugin that allows parsing of import.meta. It uses an MIT license."},{"name":"eslint-plugin-standard","description":" ESlint Plugin for the Standard Linter is a popular plugin written in JavaScript. It uses an MIT license. It's a plugin for the Standard Linter. It is being used by millions of developers worldwide."},{"name":"cheerio","description":" Cheerio is a tiny, fast, and elegant implementation of core jQuery designed specifically for the server. It is being used by millions of developers worldwide."},{"name":"json5","description":" JSON5 is a JavaScript library that is used to parse and stringify JSON. It is written in JavaScript and uses an MIT license. JSON5 is a popular library that is used by millions of developers worldwide."},{"name":"query-string","description":" The query-string library is a popular library written in JavaScript that uses an MIT license. It is used to parse and stringify URL query strings."},{"name":"update-notifier","description":" update-notifier is a simple module that helps you keep your CLI app up to date. It uses a BSD-2-Clause license."},{"name":"json5","description":" json5 is a popular JavaScript library that is used to parse and stringify JSON. It uses an MIT license. It is a human-readable and -writable alternative to JSON."},{"name":"query-string","description":" Query string is a popular library written in JavaScript. It uses an MIT license. It's a library for parsing and stringifying URL query strings. It is being used by millions of developers worldwide."},{"name":"update-notifier","description":" Update-notifier is a simple library that helps you keep your CLI app up-to-date. It uses a BSD-2-Clause license."},{"name":"parcel-bundler","description":" Parcel is a bundler for JavaScript applications. It uses an MIT license. It is blazing fast and has zero configuration. It is used by millions of developers worldwide."},{"name":"@types/events","description":" @types/events is a library that provides TypeScript definitions for events. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"systemjs","description":" SystemJS is a dynamic ES module loader. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@angular/material","description":" Angular Material is a popular library written in TypeScript. It uses an MIT license. It provides a set of reusable, well-tested, and accessible UI components based on Material Design."},{"name":"react-redux","description":" React-Redux is the official React binding for Redux. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"@jest/types","description":" @jest/types is a package that contains shared types for Jest's packages. These types are used by many of Jest's packages, such as @jest/core and @jest/test-result."},{"name":"babel-plugin-transform-es2015-function-name","description":" Babel is a toolchain that is mainly used to convert ECMAScript 2015+ code into a backwards compatible version of JavaScript in current and older browsers or environments. This plugin applies ES2015 function.name semantics to all functions."},{"name":"babel-plugin-transform-es2015-template-literals","description":" Babel is a popular JavaScript compiler. This plugin allows you to compile ES2015 template literals to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-exponentiation-operator","description":" Babel plugin that compiles exponentiation operator to ES5. It uses an MIT license."},{"name":"babel-types","description":" Babel Types is a utility library for AST nodes. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-classes","description":" This plugin transforms classes using the Babel transpiler. It uses an MIT license."},{"name":"prismjs","description":" Prism is a lightweight, robust, elegant syntax highlighting library. It is a spin-off project from Dabblet. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"aws-sdk","description":" AWS SDK for JavaScript is a popular library written in JavaScript. It uses an Apache-2.0 license. It allows developers to build applications that use AWS services."},{"name":"graphql","description":" GraphQL is a query language for APIs and a runtime for fulfilling those queries with your existing data. GraphQL provides a complete and understandable description of the data in your API, gives clients the power to ask for exactly what they need and nothing more, makes it easier to evolve APIs over time, and enables powerful developer tools."},{"name":"lodash-es","description":" Lodash is a popular library written in JavaScript. It uses an MIT license. It's exported as ES modules. It's a utility library with many useful functions. It is being used by millions of developers worldwide."},{"name":"browserslist","description":" Browserslist is a project that enables developers to share target browsers between different front-end tools. It is released under an MIT license."},{"name":"@svgr/webpack","description":" @svgr/webpack is a popular webpack loader written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"@fortawesome/free-solid-svg-icons","description":" @fortawesome/free-solid-svg-icons is a popular font, CSS, and SVG framework. It is being used by millions of developers worldwide."},{"name":"html-entities","description":" html-entities is a fast and lightweight library for encoding and decoding HTML entities. It uses an MIT license."},{"name":"gulp-sourcemaps","description":" gulp-sourcemaps is a popular plugin written in JavaScript. It uses an ISC license. It's a plugin for gulpjs that provides sourcemap support. It is being used by many developers worldwide."},{"name":"lodash.debounce","description":" The lodash.debounce method exported as a module. It is a popular utility library written in JavaScript. It uses an MIT license."},{"name":"lodash.sortby","description":" Lodash is a popular utility library written in JavaScript. It uses an MIT license. It has a wide range of utility methods, one of which is `_.sortBy`. This module exports the `_.sortBy` method so that it can be used in other projects."},{"name":"compression","description":" Compression is a Node.js compression middleware. It uses an MIT license. It is a simple and efficient way to compress and decompress files."},{"name":"find-up","description":" Find-up is a small utility written in JavaScript that allows you to find a file or directory by walking up parent directories. It is released under the MIT license."},{"name":"tmp","description":" Tmp is a simple and easy to use temporary file and directory creator. It is released under the MIT license."},{"name":"underscore.string","description":" Underscore.string is a library that extends the functionality of the Underscore.js library. It uses an MIT license. It adds string manipulation functions to Underscore.js. These functions make it easy to work with strings in JavaScript."},{"name":"browserify","description":" Browserify is a popular tool written in JavaScript. It uses an MIT license. It lets you require('modules') in the browser by bundling up all of your dependencies."},{"name":"pug","description":" Pug is a clean, whitespace-sensitive template language for writing HTML. It uses an MIT license. Pug is available on Github."},{"name":"graceful-fs","description":" graceful-fs is a drop-in replacement for the fs module, making various improvements. It is licensed under the ISC license."},{"name":"koa","description":" Koa is a web app framework written in JavaScript. It uses an MIT license. It is a lightweight, efficient, and flexible framework for building web apps. It is being used by millions of developers worldwide."},{"name":"lodash.uniq","description":" The lodash method `_.uniq` exported as a module. It uses an MIT license. It is a simple, efficient, and versatile module that helps with a variety of tasks related to arrays."},{"name":"@babel/plugin-transform-named-capturing-groups-regex","description":" This Babel plugin transforms regular expressions using named groups into ES5 code. It is useful for compiling regular expressions that use named groups to be compatible with older browsers."},{"name":"unified","description":" Unified is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"mime-db","description":" mime-db is a database of media types. It is used by web developers to lookup the correct media type when working with different types of files. It is released under an MIT license."},{"name":"@babel/runtime-corejs3","description":" @babel/runtime-corejs3 is a Babel plugin that enables the use of the modular runtime helpers with the core-js@3 polyfill. It is released under the MIT license."},{"name":"compression","description":" Compression is a Node.js compression middleware. It is licensed under the MIT license."},{"name":"lodash.debounce","description":" Lodash is a JavaScript utility library that provides many functions for working with arrays, objects, and strings. The debounce function is one of the many functions provided by lodash. It is used to limit the number of times a function can be called in a given period of time. This is useful for rate limiting."},{"name":"lodash.defaults","description":" The lodash.defaults module is a popular JavaScript library that provides utility methods for setting default values for objects. It is released under an MIT license."},{"name":"lodash.sortby","description":" Lodash is a JavaScript utility library that provides a lot of useful functions for manipulating arrays, objects, and strings. The `_.sortBy` method is one of the many functions it provides. It is exported as a module so it can be used in other projects."},{"name":"gulp-sourcemaps","description":" gulp-sourcemaps is a popular plugin written in JavaScript. It uses an ISC license. It's a plugin that allows for easy sourcemap support for gulpjs. It is being used by many developers worldwide."},{"name":"stylus-loader","description":" Stylus-loader is a popular loader for webpack written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"nopt","description":" nopt is a popular Node.js library that is used for option parsing. It supports types, shorthands, etc. It is used by npm, the Node.js package manager."},{"name":"nock","description":" Nock is a popular library written in JavaScript. It uses an MIT license. It's a HTTP server mocking and expectations library for Node.js. It is being used by millions of developers worldwide."},{"name":"yargs-parser","description":" yargs-parser is a popular library used by yargs. It uses an ISC license. It's a mighty option parser used by yargs. It is being used by millions of developers worldwide."},{"name":"figures","description":" Figures is a JavaScript library that provides Unicode symbols with fallbacks for older terminals. It is released under the MIT license."},{"name":"mobx","description":" MobX is a simple, scalable state management library that is used by millions of developers worldwide. It is MIT licensed."},{"name":"@babel/helper-module-transforms","description":" @babel/helper-module-transforms is a Babel helper library that provides helper functions for implementing ES6 module transformations. It is released under the MIT license."},{"name":"@babel/plugin-transform-computed-properties","description":" This Babel plugin transforms ES2015 computed properties to ES5. It uses an MIT license."},{"name":"@babel/plugin-transform-modules-systemjs","description":" @babel/plugin-transform-modules-systemjs is a Babel plugin that transforms ES2015 modules to SystemJS. It uses an MIT license."},{"name":"@material-ui/styles","description":" Material-UI Styles is the styling solution of Material-UI. It is written in JavaScript and uses an MIT license. It provides a simple, clean, and powerful way to style Material-UI components."},{"name":"@babel/plugin-transform-literals","description":" This Babel plugin transforms ES2015 unicode string and number literals to ES5. It is licensed under the MIT license."},{"name":"sass","description":" Sass is a CSS pre-processor. It is a popular tool used by millions of developers worldwide. Sass is written in JavaScript and uses an MIT license."},{"name":"@babel/plugin-transform-block-scoped-functions","description":" This Babel plugin ensures that function declarations at the block level are block scoped. This is useful for ensuring that your code is properly modularized."},{"name":"popper.js","description":" Popper.js is a kickass library to manage your poppers. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"source-map-loader","description":" source-map-loader is a loader for webpack that extracts inlined source map and offers it to webpack. It is being used by millions of developers worldwide."},{"name":"tar","description":" Tar is a popular library written in JavaScript. It uses an ISC license. It's a library for Node that provides the ability to create and extract tar archives."},{"name":"@babel/plugin-syntax-typescript","description":" @babel/plugin-syntax-typescript is a Babel plugin that allows parsing of TypeScript syntax. It uses an MIT license."},{"name":"vuetify","description":" Vuetify is a popular Material Component Framework for Vue.js. It uses an MIT license. It is a fast, lightweight, and customizable framework that helps you create amazing applications."},{"name":"type-fest","description":" Type Fest is a collection of essential TypeScript types. It is released under the MIT license or CC0-1.0."},{"name":"@types/chai-as-promised","description":" @types/chai-as-promised is a TypeScript definition file for the chai-as-promised library. This library provides a set of assertions for working with promises in TypeScript."},{"name":"babel-messages","description":" Babel-messages is a collection of debug messages used by Babel. It is released under the MIT license."},{"name":"babel-plugin-transform-regenerator","description":" Babel plugin that explodes async and generator functions into a state machine. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-react-display-name","description":" This Babel plugin adds a displayName property to React.createClass calls. This is helpful for debugging React applications."},{"name":"pg","description":" PG is a pure JavaScript client for PostgreSQL. It has the same API as the popular libpq library. It is being used by millions of developers worldwide."},{"name":"vue-router","description":" Vue Router is a popular router library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible router library for building interfaces. It is being used by millions of developers worldwide."},{"name":"@types/long","description":" This is a stub TypeScript definitions entry for long, which provides its own types definitions. It uses an MIT license."},{"name":"@types/mongodb","description":" @types/mongodb is a popular library that provides its own types definitions for the MongoDB database. It is being used by millions of developers worldwide."},{"name":"@types/cors","description":" @types/cors is a library that provides TypeScript definitions for cors. It is released under the MIT license."},{"name":"@types/react-native","description":" @types/react-native is a TypeScript definition file for the popular React Native library. It uses an MIT license. This definition file allows TypeScript to understand the React Native library and provides support for autocompletion and type checking."},{"name":"@types/react-redux","description":" @types/react-redux is a TypeScript definition file for the react-redux library. It uses an MIT license."},{"name":"release-it","description":" Release-it is a generic CLI tool to automate versioning and package publishing related tasks. It is released under the MIT license. It is being used by many developers worldwide."},{"name":"gatsby-plugin-sharp","description":" gatsby-plugin-sharp is a wrapper of the Sharp image manipulation library for Gatsby plugins. It uses an MIT license. It's a fast, efficient way to manipulate images."},{"name":"gatsby-remark-images","description":" gatsby-remark-images is a plugin for Gatsby that processes images in markdown so they can be used in the production build. It is released under the MIT license."},{"name":"@types/body-parser","description":" @types/body-parser is a TypeScript definition file for the body-parser library. It uses an MIT license."},{"name":"react-hot-loader","description":" React Hot Loader is a plugin that allows React components to be live-reloaded without the need for a full page refresh. It uses an MIT license."},{"name":"rollup-plugin-commonjs","description":" Rollup is a module bundler for JavaScript which compiles small pieces of code into something larger and more complex, such as a library or application. This plugin converts CommonJS modules to ES2015 so they can be used with Rollup."},{"name":"rollup-plugin-babel","description":" rollup-plugin-babel is a popular plugin that provides seamless integration between Rollup and Babel. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"redux-thunk","description":" Redux Thunk is a middleware for Redux. It allows you to write async actions. It uses an MIT license."},{"name":"gulp-rename","description":" Gulp is a popular JavaScript task runner. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"isomorphic-fetch","description":" Isomorphic WHATWG Fetch API, for Node & Browserify. This library provides an interface for fetching resources. It is being used by millions of developers worldwide."},{"name":"lodash.template","description":" The Lodash `_.template` method is exported as a module. It is a popular library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"micromatch","description":" Micromatch is a popular library written in JavaScript. It uses an MIT license. It's a replacement and faster alternative to minimatch and multimatch. It is being used by millions of developers worldwide."},{"name":"esprima","description":" Esprima is a popular library written in JavaScript. It uses a BSD-2-Clause license. It is a parsing infrastructure for multipurpose analysis. It is being used by millions of developers worldwide."},{"name":"lodash.keys","description":" Lodash is a JavaScript utility library that provides many helper functions. The `_.keys` method is one of them. It returns an array of the given object's own enumerable property names."},{"name":"strip-ansi","description":" strip-ansi is a popular library written in JavaScript. It uses an MIT license. It's a library for stripping ANSI escape codes from a string."},{"name":"http-proxy","description":" HTTP Proxy is a popular library written in JavaScript. It uses an MIT license. It's a powerful HTTP proxying tool that is being used by millions of developers worldwide."},{"name":"ramda","description":" Ramda is a practical functional library for JavaScript programmers. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"esprima","description":" Esprima is a popular library written in JavaScript. It uses a BSD-2-Clause license. It is a parsing infrastructure for multipurpose analysis. It is being used by millions of developers worldwide."},{"name":"http-proxy","description":" HTTP Proxy is a simple, lightweight, and powerful HTTP proxy server written in Node.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"eventsource","description":" eventsource is a W3C compliant EventSource client for Node.js and browser (polyfill). It is being used by millions of developers worldwide."},{"name":"@nestjs/common","description":" Nest is a modern, fast, powerful node.js web framework written in TypeScript. It uses an MIT license. Nest is used by millions of developers worldwide."},{"name":"yarn","description":" Yarn is a fast, reliable, and secure dependency management tool. It uses a BSD-2-Clause license. It is being used by millions of developers worldwide."},{"name":"@types/yargs-parser","description":" @types/yargs-parser is a TypeScript definition file for yargs-parser. It uses an MIT license. This definition file allows TypeScript to understand the yargs-parser API."},{"name":"jshint","description":" JSHint is a static analysis tool written in JavaScript. It uses an MIT license. It is used by developers to check their code for errors."},{"name":"jest-leak-detector","description":" Jest Leak Detector is a module for verifying whether an object has been garbage collected or not. It is licensed under the MIT license."},{"name":"@angular/cdk","description":" The Angular CDK is a library of reusable UI components that help developers build Angular applications. It uses an MIT license."},{"name":"documentation","description":" Documentation is a popular documentation generator. It uses an ISC license. It's a simple and easy to use documentation generator that helps developers to create beautiful documentation."},{"name":"@types/react-test-renderer","description":" @types/react-test-renderer is a library that allows for TypeScript definitions to be used with the react-test-renderer library. This library is MIT licensed."},{"name":"@types/tapable","description":" @types/tapable is a TypeScript definition file for tapable. It uses an MIT license. Tapable is a popular library written in JavaScript. It is used for building interfaces."},{"name":"stylelint","description":" Stylelint is a modern CSS linter written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"bn.js","description":" bn.js is a popular library written in JavaScript. It uses an MIT license. It's a Big number implementation in pure javascript."},{"name":"angular-animate","description":" Angular-animate is an AngularJS module for animations. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"angular-mocks","description":" AngularJS mocks for testing is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-es3-member-expression-literals","description":" Babel plugin that ensures that reserved words are quoted in property accesses. This prevents errors in older browsers that do not support ES3."},{"name":"babel-plugin-transform-react-constant-elements","description":" babel-plugin-transform-react-constant-elements is a plugin for Babel 6 that treats React JSX elements as value types and hoists them to the highest scope. This is a performance optimization that can improve the load time of React applications."},{"name":"babel-plugin-syntax-class-properties","description":" Babel plugin that allows parsing of class properties. It uses an MIT license."},{"name":"babel-plugin-syntax-flow","description":" Babel plugin that allows parsing of the flow syntax. It uses an MIT license."},{"name":"@types/geojson","description":" @types/geojson is a library that provides TypeScript definitions for geojson. It is released under the MIT license."},{"name":"@types/marked","description":" @types/marked provides TypeScript definitions for Marked, a popular JavaScript library. It uses an MIT license."},{"name":"@types/supertest","description":" @types/supertest is a TypeScript definition file for SuperTest. SuperTest is a library for testing HTTP servers. It is written in JavaScript and uses an MIT license."},{"name":"@types/webpack","description":" @types/webpack is a TypeScript definition file for webpack. It uses an MIT license. This definition file allows TypeScript to understand the webpack module."},{"name":"@types/ws","description":" @types/ws is a TypeScript definition file that provides types for the ws library. It uses an MIT license."},{"name":"@types/koa","description":" @types/koa is a TypeScript definition file that provides TypeScript definitions for Koa, a web framework written in JavaScript. It is released under the MIT license."},{"name":"@types/mkdirp","description":" @types/mkdirp is a library that provides TypeScript definitions for mkdirp."},{"name":"gatsby","description":" Gatsby is a popular site generator written in React. It uses an MIT license. It's a blazing fast modern site generator for React. It is being used by millions of developers worldwide."},{"name":"archiver","description":" Archiver is a streaming interface for archive generation. It is being used by millions of developers worldwide."},{"name":"lodash.isplainobject","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The `_.isPlainObject` method is exported as a module. It is used to check if an object is a plain object, i.e. an object created by the `Object` constructor or one with a `[[Prototype]]` of `null`."},{"name":"npmlog","description":" npmlog is a logger for npm. It is used to output logs from npm commands. It is licensed under the ISC license."},{"name":"resolve-url-loader","description":" Resolve-url-loader is a webpack loader that resolves relative paths in url() statements based on the original source file. It is being used by webpack users worldwide."},{"name":"rollup-plugin-node-resolve","description":" rollup-plugin-node-resolve is a plugin for Rollup that bundles third-party dependencies in node_modules. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-member-expression-literals","description":" This Babel plugin ensures that reserved words are quoted in property accesses. This plugin is MIT licensed."},{"name":"dotenv-expand","description":" Dotenv-expand is a library that allows you to expand environment variables using dotenv. It is released under the BSD-2-Clause license."},{"name":"jest-serializer","description":" Jest is a popular JavaScript testing library. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"webpack-manifest-plugin","description":" The webpack-manifest-plugin is a Webpack plugin for generating asset manifests. It uses an MIT license."},{"name":"enhanced-resolve","description":" Enhanced-resolve is a popular library written in JavaScript. It uses an MIT license. It offers a async require.resolve function. It's highly configurable. It is being used by millions of developers worldwide."},{"name":"opn","description":" Opn is a popular library written in JavaScript. It uses an MIT license. It's a cross-platform library for opening URLs, files, and executables."},{"name":"p-map","description":" p-map is a library that allows you to map over promises concurrently. It is released under the MIT license."},{"name":"@babel/plugin-proposal-dynamic-import","description":" This Babel plugin transforms import() expressions into dynamic imports. It allows you to dynamically import modules at runtime."},{"name":"pify","description":" pify is a popular JavaScript library that allows you to promisify a callback-style function. It uses an MIT license."},{"name":"ini","description":" ini is a simple ini encoder/decoder for node. It is released under the ISC license."},{"name":"xtend","description":" xtend is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"lodash.isarray","description":" lodash.isarray is a module that allows you to check if a value is an array. It uses an MIT license."},{"name":"assert","description":" Assert provides a simple set of assertion functions for verifying the state of your program. It is used in Node.js and in the browser. It is MIT licensed."},{"name":"camelcase-keys","description":" Camelcase-keys is a library that converts object keys to camel case. It uses an MIT license."},{"name":"ip","description":" IP is a simple library that allows you to get your public IP address. It uses an MIT license."},{"name":"@babel/plugin-transform-property-literals","description":" This Babel plugin ensures that reserved words are quoted in object property keys. It is released under the MIT license."},{"name":"@babel/plugin-syntax-export-default-from","description":" This Babel plugin allows parsing of export default from. It uses an MIT license."},{"name":"follow-redirects","description":" The follow-redirects module is a popular module written in JavaScript that uses an MIT license. It provides HTTP and HTTPS modules that follow redirects. It is being used by millions of developers worldwide."},{"name":"on-finished","description":" on-finished is a library that allows you to execute a callback when a request closes, finishes, or errors. It is released under the MIT license."},{"name":"@types/react-transition-group","description":" @types/react-transition-group is a library that provides type definitions for the react-transition-group library. It uses an MIT license."},{"name":"multer","description":" Multer is a middleware for handling multipart/form-data. It is used by millions of developers worldwide. It is licensed under the MIT license."},{"name":"@babel/plugin-proposal-unicode-property-regex","description":" This Babel plugin allows you to use Unicode property escapes in Unicode regular expressions. It compiles them to ES5."},{"name":"@babel/plugin-transform-for-of","description":" This Babel plugin transforms for...of statements to ES5. It is licensed under the MIT license."},{"name":"@babel/plugin-transform-modules-amd","description":" This plugin transforms ES2015 modules to AMD. It uses an MIT license."},{"name":"@babel/plugin-transform-new-target","description":" Babel is a popular JavaScript transpiler. This plugin transforms the new.target meta property. It uses an MIT license."},{"name":"jest-worker","description":" Jest-worker is a module for executing heavy tasks under forked processes in parallel, by providing a `Promise` based interface, minimum overhead, and bound workers. It is being used by millions of developers worldwide."},{"name":"@jest/environment","description":" @jest/environment is a library that allows you to test your code in a realistic environment. It uses an MIT license."},{"name":"@types/react-transition-group","description":" @types/react-transition-group is a library that provides type definitions for react-transition-group. It uses an MIT license. This library is helpful for developers who are using TypeScript with react-transition-group."},{"name":"@jest/environment","description":" Jest is a JavaScript testing framework. It uses an MIT license. @jest/environment is a package that provides a test environment for Jest."},{"name":"jest-worker","description":" Jest-worker is a module for executing heavy tasks under forked processes in parallel, by providing a `Promise` based interface, minimum overhead, and bound workers. It uses an MIT license."},{"name":"@babel/helper-annotate-as-pure","description":" This helper function is used to annotate paths and nodes with a #__PURE__ comment. This is useful for optimizing code that uses React."},{"name":"webpack-bundle-analyzer","description":" The webpack-bundle-analyzer is a plugin and CLI utility that represents bundle content as a convenient interactive zoomable treemap. It uses an MIT license."},{"name":"jest-regex-util","description":" Jest regex util is a library that provides utility functions for working with regular expressions. It uses an MIT license."},{"name":"babel-plugin-transform-es2015-unicode-regex","description":" Babel plugin that compiles ES2015 Unicode regex to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-decorators","description":" Babel is a popular JavaScript compiler. This plugin transforms class and object decorators to ES5. It uses an MIT license."},{"name":"babel-plugin-transform-function-bind","description":" This Babel plugin transforms the function bind operator to ES5 compatible code. This is useful for compatibility with older browsers. The plugin is released under the MIT license."},{"name":"babel-plugin-syntax-decorators","description":" Babel is a popular tool that allows developers to write code in the latest versions of JavaScript. This plugin allows developers to use the latest syntax for decorators."},{"name":"@commitlint/config-conventional","description":" This is a shareable commitlint config enforcing conventional commits. It uses an MIT license."},{"name":"scheduler","description":" Scheduler is a cooperative scheduler for the browser environment. It is being used by millions of developers worldwide."},{"name":"@types/semver","description":" @types/semver is a TypeScript definition file for the semver library. It uses an MIT license."},{"name":"@storybook/node-logger","description":" @storybook/node-logger is a node logging package that is used by storybook. It uses an MIT license."},{"name":"three","description":" Three is a popular JavaScript 3D library. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@storybook/components","description":" @storybook/components is a library of core Storybook components. It is released under the MIT license."},{"name":"@types/core-js","description":" @types/core-js is a library that provides TypeScript definitions for core-js. It uses an MIT license."},{"name":"@types/superagent","description":" @types/superagent is a library that provides type definitions for the SuperAgent library. It uses an MIT license."},{"name":"gatsby-plugin-react-helmet","description":" gatsby-plugin-react-helmet is a plugin for Gatsby that allows you to manage document head data with react-helmet. It provides drop-in server rendering support for Gatsby. It is released under the MIT license."},{"name":"gatsby-source-filesystem","description":" Gatsby source plugin for building websites from local data. It supports many data types, including Markdown, JSON, images, YAML, CSV, and others. It is being used by millions of developers worldwide."},{"name":"jasmine","description":" Jasmine is a simple JavaScript testing framework for browsers and Node. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"karma-coverage","description":" A Karma plugin that generates code coverage. It is released under the MIT license."},{"name":"bytes","description":" Bytes is a utility to parse a string bytes to bytes and vice-versa. It is released under the MIT license."},{"name":"deepmerge","description":" Deepmerge is a popular library written in JavaScript. It uses an MIT license. It's a library for deep (recursive) merging of Javascript objects. It is being used by millions of developers worldwide."},{"name":"postcss-import","description":" The postcss-import plugin is a PostCSS plugin that allows you to import CSS files. It uses an MIT license."},{"name":"open","description":" Open is a cross-platform library for opening stuff like URLs, files, and executables. It is released under the MIT license."},{"name":"iconv-lite","description":" iconv-lite is a pure JavaScript library for character encoding conversion. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-reserved-words","description":" This plugin ensures that no reserved words are used. It uses an MIT license."},{"name":"eslint-plugin-html","description":" This ESLint plugin lints and fixes inline scripts contained in HTML files. It uses an ISC license."},{"name":"less-loader","description":" less-loader is a Less loader for webpack. It compiles Less to CSS. It's being used by millions of developers worldwide."},{"name":"node-gyp","description":" Node.js native addon build tool"},{"name":"@babel/plugin-transform-exponentiation-operator","description":" This Babel plugin transforms the exponentiation operator (**) to ES5. It uses an MIT license."},{"name":"@babel/plugin-transform-unicode-regex","description":" This Babel plugin transforms Unicode regex into ES5 compatible regex. It is being used by many developers to improve compatibility with older browsers."},{"name":"@babel/plugin-transform-duplicate-keys","description":" This Babel plugin transforms objects with duplicate keys into valid strict ES5 code. It is licensed under the MIT license."},{"name":"@babel/helper-simple-access","description":" Babel helper for ensuring that access to a given value is performed through simple accesses. It uses an MIT license."},{"name":"@babel/plugin-transform-sticky-regex","description":" This Babel plugin transforms sticky regex into an ES5 RegExp constructor. It uses an MIT license."},{"name":"passport","description":" Passport is a simple, unobtrusive authentication library for Node.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-logical-assignment-operators","description":" Babel is a popular JavaScript transpiler. This plugin transforms logical assignment operators into short-circuited assignments. It uses an MIT license."},{"name":"leaflet","description":" Leaflet is a popular JavaScript library for mobile-friendly interactive maps. It uses a BSD-2-Clause license. Leaflet is easy to use and has a wide range of features."},{"name":"postcss-discard-comments","description":" PostCSS is a tool for transforming CSS with JavaScript. It is used by millions of developers worldwide. This plugin allows you to discard comments in your CSS files with PostCSS."},{"name":"@angular/upgrade","description":" @angular/upgrade is a library written in JavaScript that eases the update from AngularJS v1 to Angular v2. It uses an MIT license."},{"name":"@vue/cli-plugin-eslint","description":" This plugin adds support for eslint to the vue-cli. It uses an MIT license."},{"name":"@emotion/styled","description":" The styled API for emotion is a popular library that allows developers to style their applications using JavaScript. It uses an MIT license."},{"name":"@babel/plugin-transform-object-super","description":" This Babel plugin transforms object super to ES5. It is licensed under the MIT license."},{"name":"@babel/helpers","description":" @babel/helpers is a helper library written in JavaScript. It uses an MIT license. It is being used by Babel, a popular JavaScript transpiler."},{"name":"mongoose","description":" Mongoose is an Object Data Modeling (ODM) library for MongoDB and Node.js. It is licensed under the MIT license. It provides a straightforward, schema-based solution to model your application data. It includes built-in type casting, validation, query building, business logic hooks, and more, out of the box."},{"name":"angular-sanitize","description":" Angular-sanitize is an AngularJS module for sanitizing HTML. It is licensed under the MIT license."},{"name":"markdown-it","description":" Markdown-it is a popular library written in JavaScript. It uses an MIT license. It's a modern pluggable markdown parser. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-es3-property-literals","description":" Babel is a popular JavaScript compiler. This plugin ensures that reserved words are quoted in object property keys. It uses an MIT license."},{"name":"babel-plugin-transform-react-jsx-source","description":" This plugin adds a __source prop to all JSX Elements. This allows you to easily see the source code for each element in the React DevTools."},{"name":"caniuse-lite","description":" Caniuse-lite is a smaller version of caniuse-db, with only the essentials! It is released under the CC-BY-4.0 license."},{"name":"@types/history","description":" @types/history is a stub TypeScript definitions entry for history, which provides its own types definitions. It uses an MIT license."},{"name":"@types/uglify-js","description":" @types/uglify-js is a TypeScript definition file for UglifyJS. It uses an MIT license. UglifyJS is a JavaScript library that minifies code."},{"name":"gatsby-plugin-manifest","description":" This plugin is for the Gatsby static site generator. It adds a manifest.webmanifest file to make sites progressive web apps. The file is used by browsers to make the site work offline and improve performance."},{"name":"benchmark","description":" Benchmark is a JavaScript benchmarking library that is used to test the performance of code. It uses an MIT license. It is reliable and easy to use. It is being used by millions of developers worldwide."},{"name":"coffee-script","description":" CoffeeScript is a JavaScript library that is being used by millions of developers worldwide. It is a popular library that uses an MIT license. It is a declarative, efficient, and flexible library for building interfaces."},{"name":"lodash.assign","description":" The lodash.assign module is a popular JavaScript library that provides utility methods for working with objects. It uses an MIT license."},{"name":"@babel/plugin-proposal-function-sent","description":" @babel/plugin-proposal-function-sent is a Babel plugin that compiles the function.sent meta property to valid ES2015 code. It uses an MIT license."},{"name":"@babel/plugin-external-helpers","description":" @babel/plugin-external-helpers is a popular plugin written in JavaScript. It uses an MIT license. It contains helper functions that’ll be placed at the top of the generated code. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-object-assign","description":" @babel/plugin-transform-object-assign is a Babel plugin that replaces Object.assign with an inline helper. It is released under the MIT license."},{"name":"inherits","description":" Inherits is a browser-friendly inheritance fully compatible with standard node.js inherits(). It is released under the ISC license."},{"name":"concat-stream","description":" Concat-stream is a writable stream that concatenates strings or binary data and calls a callback with the result. It is useful for creating composite streams, such as a stream of data from multiple sources. It is licensed under the MIT license."},{"name":"cross-spawn","description":" Cross-spawn is a library that allows you to spawn child processes on multiple platforms. It is licensed under the MIT license."},{"name":"mkdirp","description":" mkdirp is a popular module written in JavaScript. It uses an MIT license. It's a recursive directory creation utility."},{"name":"pako","description":" Pako is a zlib port to javascript. It uses an MIT and Zlib license. It is a fast, modularized, with browser support library. It is being used by millions of developers worldwide."},{"name":"lodash.clonedeep","description":" The lodash.clonedeep method is exported as a module. It is a popular library written in JavaScript. It uses an MIT license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"babel-plugin-dynamic-import-node","description":" Babel plugin to transpile import() to a deferred require(), allowing dynamic loading of node modules."},{"name":"log-symbols","description":" Log symbols is a popular library written in JavaScript. It uses an MIT license. It is a library for colored symbols for various log levels. It is being used by millions of developers worldwide."},{"name":"http-server","description":" http-server is a simple zero-configuration command-line http server. It is released under the MIT license."},{"name":"through2","description":" Through2 is a small wrapper around Node.js streams.Transform (Streams2/3) to avoid explicit subclassing noise. It is released under an MIT license."},{"name":"espree","description":" Espree is a popular JavaScript parser written in JavaScript. It uses a BSD-2-Clause license. It's a declarative, efficient, and flexible library for building interfaces. It is being used by millions of developers worldwide."},{"name":"source-map-support","description":" source-map-support is a library that provides source map support for stack traces in node. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"optimize-css-assets-webpack-plugin","description":" This Webpack plugin optimizes \\ minimizes CSS assets. It uses an MIT license."},{"name":"babel-plugin-jest-hoist","description":" Babel plugin to hoist `jest.disableAutomock`, `jest.enableAutomock`, `jest.unmock`, `jest.mock`, calls above `import` statements. This plugin is automatically included when using [babel-jest](https://github.com/facebook/jest/tree/main/packages/babel-jest)."},{"name":"diff-sequences","description":" Diff-sequences is a library that allows you to compare items in two sequences to find a longest common subsequence. It is released under the MIT license."},{"name":"node-forge","description":" Node-forge is a popular JavaScript library written in JavaScript. It uses a BSD-3-Clause license. It's a library for building interfaces. It is being used by millions of developers worldwide."},{"name":"stylus","description":" Stylus is a popular CSS superset written in JavaScript. It uses an MIT license. It's a robust, expressive, and feature-rich library that makes CSS development more enjoyable. It is being used by millions of developers worldwide."},{"name":"create-react-class","description":" create-react-class is a legacy API for creating React components. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-transform-function-name","description":" This Babel plugin applies ES2015 function.name semantics to all functions."},{"name":"@babel/plugin-transform-shorthand-properties","description":" @babel/plugin-transform-shorthand-properties is a Babel plugin that compiles ES2015 shorthand properties to ES5. It uses an MIT license."},{"name":"@babel/plugin-transform-typeof-symbol","description":" This is a Babel plugin that transforms typeof expressions. It wraps all typeof expressions with a method that replicates native behaviour. It is released under the MIT license."},{"name":"webpack-merge","description":" webpack-merge is a variant of merge that's useful for webpack configuration. It's MIT licensed."},{"name":"selenium-webdriver","description":" Selenium is a popular open source project that provides a suite of tools for automating web browsers. The selenium-webdriver project provides the official JavaScript bindings for the WebDriver API. The project is licensed under the Apache-2.0 license."},{"name":"strip-json-comments","description":" Strip comments from JSON. Lets you use comments in your JSON files!"},{"name":"@vue/cli-service","description":" @vue/cli-service is a local service for vue-cli projects. It uses an MIT license. It provides a development server, build tools, and configuration management for Vue projects."},{"name":"ember-data","description":" Ember Data is a data layer written in JavaScript. It uses an MIT license. It is used for Ember applications. Ember Data makes it easy to load and save data in your Ember applications."},{"name":"@types/webpack-env","description":" @types/webpack-env is a TypeScript definition file that provides type information for the webpack module API. It is licensed under the MIT license."},{"name":"@types/react-router-dom","description":" @types/react-router-dom is a library that provides TypeScript definitions for react-router-dom. It uses an MIT license."},{"name":"angular-route","description":" AngularJS is a popular JavaScript framework. The angular-route module provides routing and deeplinking services and directives for AngularJS. It uses an MIT license."},{"name":"terser-webpack-plugin","description":" Terser is a popular JavaScript library that is used by webpack to minify JavaScript files."},{"name":"@jest/test-result","description":" Jest is a JavaScript testing framework that provides a complete testing solution. It is used by millions of developers worldwide."},{"name":"@types/react-router-dom","description":" This is a type definition file for the popular React Router DOM library. This library provides routing functionality for React applications. This file allows you to use the React Router DOM library in your TypeScript projects."},{"name":"@types/webpack-env","description":" @types/webpack-env is a TypeScript library that provides type definitions for webpack. It uses an MIT license."},{"name":"ember-data","description":" Ember-data is a data layer for Ember applications. It is written in JavaScript and uses an MIT license. It is a popular library used by many developers."},{"name":"strip-json-comments","description":" Strip comments from JSON files! This lets you use comments in your JSON files. It is released under an MIT license."},{"name":"selenium-webdriver","description":" Selenium is a popular open source testing tool. The selenium-webdriver module is the official WebDriver JavaScript bindings from the Selenium project. It uses an Apache-2.0 license. It is being used by millions of developers worldwide."},{"name":"angular-route","description":" AngularJS is a popular open-source JavaScript framework. The angular-route module is an official router module for AngularJS. It uses an MIT license."},{"name":"handlebars","description":" Handlebars is a popular templating library written in JavaScript. It uses an MIT license. It is a powerful library that allows you to build semantic templates with no frustration."},{"name":"@types/request","description":" @types/request is a TypeScript definition file that provides TypeScript definitions for the request library. It is released under the MIT license."},{"name":"babel-helpers","description":" Babel is a JavaScript compiler. Babel-helpers is a collection of helper functions used by Babel transforms. It is released under the MIT license."},{"name":"@commitlint/cli","description":" @commitlint/cli is a popular tool written in JavaScript that lints your commit messages. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"chart.js","description":" Chart.js is a simple HTML5 charts library using the canvas element. It is being used by millions of developers worldwide."},{"name":"@ngtools/webpack","description":" The @ngtools/webpack plugin is a Webpack plugin that AoT compiles your Angular components and modules. It uses an MIT license."},{"name":"moment-timezone","description":" Moment Timezone is a popular JavaScript library that uses an MIT license. It allows you to parse and display moments in any timezone."},{"name":"ms","description":" MS is a tiny millisecond conversion utility. It is licensed under the MIT license. It is being used by millions of developers worldwide."},{"name":"concurrently","description":" Concurrently is a popular library written in JavaScript. It uses an MIT license. It's a library for running commands concurrently. It is being used by millions of developers worldwide."},{"name":"gatsby-transformer-sharp","description":" gatsby-transformer-sharp is a Gatsby plugin that uses the Sharp image processing library to transform images. It is released under an MIT license."},{"name":"gatsby-transformer-remark","description":" This is a Gatsby transformer plugin that uses the Remark library to transform Markdown files. It has an MIT license. It is being used by millions of developers worldwide."},{"name":"gatsby-plugin-offline","description":" Gatsby plugin which sets up a site to be able to run offline. It uses an MIT license."},{"name":"pretty-quick","description":" Pretty Quick is a fast and pretty way to get your code formatted. It is being used by millions of developers worldwide."},{"name":"postcss-flexbugs-fixes","description":" This project is a PostCSS plugin that tries to fix all of flexbug's issues. It uses an MIT license."},{"name":"cosmiconfig","description":" Cosmiconfig is a popular library written in JavaScript. It uses an MIT license. It's a tool for finding and loading configuration from a package.json property, rc file, or CommonJS module. It is being used by millions of developers worldwide."},{"name":"jsonfile","description":" jsonfile is a popular library written in JavaScript. It uses an MIT license. It's a library for easily reading and writing JSON files. It is being used by millions of developers worldwide."},{"name":"argparse","description":" Argparse is a popular CLI arguments parser. It is a native port of Python's argparse. It uses a Python-2.0 license. It is being used by millions of developers worldwide."},{"name":"querystring","description":" The querystring module provides utilities for dealing with query strings. It is a Node module written in JavaScript. It is released under an MIT license."},{"name":"builtin-modules","description":" This is a list of the Node.js builtin modules. It is released under the MIT license."},{"name":"npm-run-path","description":" npm-run-path is a popular library written in JavaScript. It uses an MIT license. It's a simple and easy to use library that allows you to get your PATH prepended with locally installed binaries. It is being used by millions of developers worldwide."},{"name":"acorn-jsx","description":" Acorn-jsx is a modern, fast React.js JSX parser. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"ipaddr.js","description":" ipaddr.js is a library written in JavaScript that allows developers to manipulate IPv4 and IPv6 addresses. It uses an MIT license. It's a popular library that is being used by millions of developers worldwide."},{"name":"request-promise-native","description":" Request-promise-native is a simplified HTTP request client that supports promises. It is powered by native ES6 promises and is being used by millions of developers worldwide."},{"name":"accepts","description":"\n\nAccepts is a higher-level content negotiation library that provides an easy way to parse and manipulate the Accept header."},{"name":"workbox-build","description":" Workbox-build is a module that integrates into your build process, helping you generate a manifest of local files that workbox-sw should precache. It is released under an MIT license."},{"name":"np","description":" np (better-npm-publish) is a tool that makes it easier and faster to publish npm packages. It uses an MIT license."},{"name":"conventional-changelog-cli","description":" Conventional Changelog CLI is a tool that generates a changelog from git metadata. It uses an MIT license. It is a simple and easy to use tool that makes it easy to keep track of changes to your codebase."},{"name":"component-emitter","description":" Component Emitter is a popular event emitter library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"connect","description":" Connect is a high performance middleware framework written in JavaScript. It is used for building web applications and APIs. It uses an MIT license."},{"name":"babel-plugin-add-module-exports","description":" Babel is a popular JavaScript compiler. This plugin is a fix for a bug in Babel. It is released under the MIT license."},{"name":"compression-webpack-plugin","description":" This plugin uses webpack to prepare compressed versions of assets to serve them with Content-Encoding. It uses an MIT license."},{"name":"lodash.isstring","description":" lodash.isstring is a module that allows you to check if a value is a string or not. It uses an MIT license."},{"name":"lodash.foreach","description":" The lodash method `_.forEach` exported as a module. It is a method that iterates over elements of an array, invoking a callback for each element. It is being used by millions of developers worldwide."},{"name":"json-stable-stringify","description":" json-stable-stringify is a popular library written in JavaScript. It uses an MIT license. It's a deterministic JSON.stringify() with custom sorting to get deterministic hashes from stringified results. It is being used by millions of developers worldwide."},{"name":"less","description":" Less is a popular CSS pre-processor written in JavaScript. It uses an Apache-2.0 license. It's a leaner CSS library that is being used by millions of developers worldwide."},{"name":"gh-pages","description":" gh-pages is a popular tool written in JavaScript. It uses an MIT license. It allows you to publish to a gh-pages branch on GitHub (or any other branch on any other remote). It is being used by millions of developers worldwide."},{"name":"babel-preset-minify","description":" This is a Babel preset for all minify plugins. It uses an MIT license."},{"name":"react-datepicker","description":" The react-datepicker library offers a simple and reusable datepicker component for React. It is licensed under the MIT license."},{"name":"sprintf-js","description":" sprintf-js is a JavaScript implementation of the sprintf function. It is released under a BSD-3-Clause license."},{"name":"protractor","description":" Protractor is a popular library written in JavaScript. It uses an MIT license. It's a webdriver E2E test wrapper for Angular. It is being used by millions of developers worldwide."},{"name":"tsickle","description":" Tsickle is a tool that helps developers transpile TypeScript code to JavaScript. It uses an MIT license. Tsickle adds Closure annotations to TypeScript code, which allows developers to use the Closure Compiler to optimize their code."},{"name":"@ngrx/store","description":" @ngrx/store is a RxJS powered Redux-like state management library for Angular apps. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"joi","description":" Joi is a popular library for object schema validation. It uses a BSD-3-Clause license. Joi allows you to create blueprints or schemas for JavaScript objects (an object that stores data) to ensure validation of key information."},{"name":"@jest/transform","description":" @jest/transform is a library that provides a way to transform JavaScript code. It uses an MIT license."},{"name":"@jest/reporters","description":" Jest's reporters are popular among developers for their ability to provide accurate and concise information about the state of tests. They are released under an MIT license."},{"name":"jest-jasmine2","description":" Jest is a JavaScript testing library that is often used with React. It uses an MIT license. Jest is a fast and reliable testing library that is used by millions of developers worldwide."},{"name":"jest-runner","description":" Jest Runner is a popular library written in JavaScript. It uses an MIT license. It's a versatile library that can be used to create various types of tests."},{"name":"@jest/test-sequencer","description":" @jest/test-sequencer is a library that helps you run your tests in a specified order. It uses an MIT license."},{"name":"preact","description":" Preact is a fast 3kb React-compatible Virtual DOM library. It uses an MIT license. It's a fast, efficient, and lightweight library that is perfect for building high-performance user interfaces."},{"name":"@types/lodash.isequal","description":" @types/lodash.isEqual is a TypeScript definition file for lodash.isEqual. It uses an MIT license."},{"name":"@types/resolve","description":" @types/resolve is a TypeScript definition file that provides TypeScript definitions for the resolve library. It is released under the MIT license."},{"name":"angular-material","description":" Angular Material is a UI component library for AngularJS developers. Angular Material is used by millions of developers worldwide and is being actively supported by the Angular team."},{"name":"raf","description":" The requestAnimationFrame polyfill is a popular polyfill for the requestAnimationFrame API. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"babel-helper-call-delegate","description":" Babel is a popular JavaScript compiler. This helper function allows you to call delegate functions. It is released under the MIT license."},{"name":"babel-plugin-transform-react-inline-elements","description":" This Babel plugin turns JSX elements into exploded React objects. This is useful for optimizing React performance."},{"name":"babel-plugin-syntax-exponentiation-operator","description":" Babel is a popular JavaScript library that allows parsing of the exponentiation operator. It uses an MIT license."},{"name":"babel-preset-es2016","description":" Babel preset for all es2016 plugins. It uses an MIT license. It is a popular preset used by many developers."},{"name":"tsickle","description":" Tsickle is a TypeScript to Closure annotations transpiler. It uses an MIT license. It is being used by the Angular team and Google Closure tools."},{"name":"joi","description":" Joi is a library for validating objects. It uses a BSD-3-Clause license. It is simple and easy to use."},{"name":"@ngrx/store","description":" @ngrx/store is a library that combines the benefits of Redux and RxJS to manage state in Angular apps. It uses an MIT license."},{"name":"sprintf-js","description":" sprintf-js is a JavaScript sprintf implementation. It uses a BSD-3-Clause license. It is a lightweight library that provides a sprintf function for JavaScript."},{"name":"@jest/test-sequencer","description":" @jest/test-sequencer is a library that helps you run your tests in a specific order. It uses an MIT license."},{"name":"jest-runner","description":" Jest is a JavaScript testing library. Jest Runner is a library that allows you to run Jest tests. Jest Runner is released under the MIT license."},{"name":"@jest/transform","description":" @jest/transform is a library that allows you to transform your code in order to be able to test it more effectively. It uses an MIT license."},{"name":"jest-jasmine2","description":" Jest is a popular JavaScript testing tool. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@jest/reporters","description":" Jest's reporters is a library that allows you to customize the way Jest outputs information."},{"name":"preact","description":" Preact is a fast 3kb React-compatible Virtual DOM library. It uses an MIT license. It's a fast, lightweight, and small library that is compatible with React. It is being used by millions of developers worldwide."},{"name":"react-reconciler","description":" React Reconciler is a React package for creating custom renderers. It is licensed under the MIT license."},{"name":"@storybook/addon-storysource","description":" @storybook/addon-storysource is a popular library written in JavaScript. It uses an MIT license. It's a library that allows you to view a story's source code to see how it works and paste it into your app. It is being used by millions of developers worldwide."},{"name":"@storybook/addon-storyshots","description":" @storybook/addon-storyshots is a popular library written in JavaScript. It uses an MIT license. It's a library that allows you to take a code snapshot of every story automatically with Jest. It is being used by millions of developers worldwide."},{"name":"@types/gulp","description":" @types/gulp provides type definitions for the Gulp toolkit. It uses an MIT license."},{"name":"@types/minimist","description":" @types/minimist is a TypeScript definition file for minimist. It uses an MIT license."},{"name":"@types/koa-router","description":" @types/koa-router is a TypeScript definition file for koa-router. koa-router is a popular router library for koa.js. @types/koa-router allows developers to use koa-router with TypeScript."},{"name":"@types/validator","description":" @types/validator is a TypeScript definition file for validator.js. It uses an MIT license. Validator.js is a library that provides a set of tools for validating data."},{"name":"@types/qs","description":" @types/qs is a TypeScript definition file for the qs library. It uses an MIT license."},{"name":"@types/diff","description":" The @types/diff package provides TypeScript definitions for the diff library. This is a popular library used for comparing two strings and calculating the differences between them. It uses an MIT license."},{"name":"@types/hammerjs","description":" @types/hammerjs is a TypeScript definition file for Hammer.js. Hammer.js is a popular library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"esm","description":" ESM is a JavaScript module system. It uses an MIT license. It is tomorrow's ECMAScript modules today. It is being used by many developers worldwide."},{"name":"morgan","description":" Morgan is a popular HTTP request logger middleware for Node.js. It uses an MIT license. It is used by millions of developers worldwide."},{"name":"ncp","description":" ncp is a popular file copy utility written in JavaScript. It uses an MIT license. It is asynchronous and recursive, making it very efficient. It is being used by millions of developers worldwide."},{"name":"object-hash","description":" Object-hash is a library that generates hashes from JavaScript objects. It is licensed under the MIT license."},{"name":"postcss-cssnext","description":" PostCSS-cssnext is a popular CSS tool written in JavaScript. It uses an MIT license. It is a tool that allows you to use tomorrow's CSS syntax today. It is being used by millions of developers worldwide."},{"name":"grunt-contrib-jshint","description":" JSHint is a popular JavaScript library that helps developers check their code for errors. Grunt is a JavaScript task runner that helps developers automate tasks like JSHint. The grunt-contrib-jshint plugin is a Grunt plugin that allows developers to run JSHint from within Grunt."},{"name":"camel-case","description":" CamelCase is a popular string transformation used in programming. It is used to transform a string into a format where each word is capitalized and the words are separated by a single space. It is being used by millions of developers worldwide."},{"name":"bootstrap-sass","description":" bootstrap-sass is a Sass-powered version of Bootstrap 3, ready to drop right into your Sass powered applications. It uses an MIT license."},{"name":"babelify","description":" Babelify is a browserify transform. It uses an MIT license. It allows you to use Babel to compile your code for the browser."},{"name":"grunt-cli","description":" The grunt command line interface is a popular tool written in JavaScript. It uses an MIT license. It is a declarative, efficient, and flexible tool for building interfaces. It is being used by millions of developers worldwide."},{"name":"grunt-contrib-jshint","description":" JSHint is a popular JavaScript linter. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"gulp-replace","description":" gulp-replace is a popular string replace plugin for gulp. It uses an MIT license. It is being used by many developers worldwide."},{"name":"gulp-autoprefixer","description":" gulp-autoprefixer is a popular CSS prefixing tool. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"lodash.flatten","description":" The lodash.flatten method exported as a module. This method is used to flatten arrays."},{"name":"lodash.map","description":" The lodash method `_.map` exported as a module. It is a popular library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"karma-webpack","description":" karma-webpack is a plugin for karma that allows you to use webpack with karma. It is licensed under the MIT license."},{"name":"lodash.throttle","description":"\n\nThe lodash.throttle module exports the lodash method `_.throttle` as a module. The lodash method `_.throttle` is a utility function that returns a new function that throttles the original function. The throttled function can be called at most once per specified period."},{"name":"karma-mocha","description":" Karma is a test runner for JavaScript. It uses an MIT license. Mocha is a testing framework. This plugin is an adapter for the Mocha testing framework."},{"name":"morgan","description":" Morgan is a popular HTTP request logger middleware for Node.js. It uses an MIT license. It is used by millions of developers worldwide."},{"name":"escape-html","description":" Escape string for use in HTML"},{"name":"ncp","description":" ncp is a utility for copying files and directories recursively. It uses an MIT license. It is asynchronous and supports recursive file copying."},{"name":"punycode","description":" Punycode is a popular JavaScript library that uses an MIT license. It is a robust Punycode converter that fully complies to RFC 3492 and RFC 5891, and works on nearly all JavaScript platforms."},{"name":"url","description":" The `url` library is a popular JavaScript library that is used to parse and resolve URLs. It is used by millions of developers worldwide."},{"name":"doctrine","description":" Doctrine is a JavaScript library that provides a way to parse and understand JavaScript code. It is released under the Apache License 2.0."},{"name":"entities","description":" Entities is a library written in JavaScript that allows you to encode and decode XML and HTML entities with ease and speed. It uses a BSD-2-Clause license."},{"name":"signal-exit","description":" SignalExit is a library that allows you to fire an event no matter how a process exits. It is licensed under the ISC license."},{"name":"escape-string-regexp","description":" Escape-string-regexp is a popular library written in JavaScript. It uses an MIT license. It's a small utility for escaping RegExp special characters."},{"name":"read-pkg-up","description":" read-pkg-up is a small utility that reads the closest package.json file. It is useful for getting information about the current project. It is released under the MIT license."},{"name":"deep-equal","description":" deep-equal is a popular library written in JavaScript. It uses an MIT license. It's a node's assert.deepEqual algorithm. It is being used by millions of developers worldwide. \n\n\nProject name: node-tap\nWhat it does: A Test-Anything-Protocol library for Node.js\nLicense: MIT\nDescription: node-tap is a popular library written in JavaScript. It uses an MIT license. It's a Test-Anything-Protocol library for Node.js. It is being used by millions of developers worldwide."},{"name":"p-limit","description":" p-limit is a popular package written in JavaScript. It uses an MIT license. It is used to run multiple promise-returning & async functions with limited concurrency."},{"name":"crypto-browserify","description":" Crypto Browserify is an implementation of crypto for the browser. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"vue-hot-reload-api","description":" vue-hot-reload-api is a hot reload api for *.vue components. It uses an MIT license. It's a simple and easy to use api that allows you to hot reload your vue components."},{"name":"tapable","description":" Tapable is a small module for plugins. It is MIT licensed. It is being used by millions of developers worldwide."},{"name":"raw-body","description":" Raw Body is a library that allows you to get and validate the raw body of a readable stream. It is being used by millions of developers worldwide."},{"name":"schema-utils","description":" schema-utils is a JavaScript library that provides utilities for validating data against a schema. It is released under the MIT license."},{"name":"babel-plugin-import","description":" babel-plugin-import is a babel plugin that enables you to import components using a modular approach. It uses an MIT license."},{"name":"babel-plugin-istanbul","description":" Babel is a JavaScript compiler. This plugin adds istanbul instrumentation to ES6 code. This is useful for code coverage tools."},{"name":"nanoid","description":" Nanoid is a tiny (116 bytes), secure URL-friendly unique string ID generator. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"typedoc","description":" typedoc is a popular library that allows you to generate api documentation for TypeScript projects. It is released under the Apache-2.0 license."},{"name":"bulma","description":" Bulma is a modern CSS framework based on Flexbox. It is being used by millions of developers worldwide."},{"name":"tweetnacl","description":" TweetNaCl is a port of the TweetNaCl cryptographic library to JavaScript. It is released under the Unlicense, which means it is in the public domain."},{"name":"jest-changed-files","description":" Jest is a JavaScript testing library. It uses an MIT license. Jest-changed-files is a module used internally by Jest to check which files have changed since you last committed in git or hg."},{"name":"chromedriver","description":" Chromedriver is a popular library used by Selenium. It uses an Apache-2.0 license. It is a fast and efficient library for driving browsers."},{"name":"acorn-walk","description":" Acorn-walk is a popular library written in JavaScript. It uses an MIT license. It's a lightweight library for walking ECMAScript ASTs. It is being used by millions of developers worldwide."},{"name":"@types/hoist-non-react-statics","description":" @types/hoist-non-react-statics is a TypeScript definition file for the popular JavaScript library hoist-non-react-statics. It uses an MIT license."},{"name":"@babel/plugin-syntax-optional-catch-binding","description":" This Babel plugin allows parsing of optional catch bindings. It uses an MIT license."},{"name":"@babel/plugin-syntax-async-generators","description":" Babel is a popular JavaScript compiler. This plugin allows parsing of async generator functions. It uses an MIT license."},{"name":"cypress","description":" Cypress is a popular end to end testing tool written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"postcss-cli","description":" postcss-cli is a popular tool written in JavaScript. It uses an MIT license. It's a command line interface for PostCSS. It is being used by millions of developers worldwide."},{"name":"ionic-angular","description":" Ionic Angular is a popular framework written in JavaScript. It uses an MIT license. It is a powerful framework for building mobile and progressive web apps with JavaScript and Angular. It is being used by millions of developers worldwide."},{"name":"@ngrx/effects","description":" @ngrx/effects is a side effect model for @ngrx/store. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/eslint","description":" @types/eslint is a TypeScript definition file for eslint. It uses an MIT license."},{"name":"jest-util","description":" Jest is a JavaScript testing library. Jest-util is a utility library for Jest. It is released under the MIT license."},{"name":"jest-validate","description":" Jest-validate is a generic configuration validation tool that helps you with warnings, errors and deprecation messages as well as showing users examples of correct configuration. It uses an MIT license."},{"name":"ethers","description":" Ethers is a popular JavaScript library that allows developers to interact with the Ethereum blockchain. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/lodash.clonedeep","description":" @types/lodash.clonedeep is a library that provides type definitions for lodash.cloneDeep. It uses an MIT license."},{"name":"@types/aws-lambda","description":" @types/aws-lambda is a popular TypeScript library for AWS Lambda. It uses an MIT license. It provides type definitions for AWS Lambda."},{"name":"@types/prettier","description":" @types/prettier is a TypeScript definition file for prettier. It uses an MIT license. Prettier is a popular code formatter written in JavaScript. It is used by millions of developers worldwide."},{"name":"@types/istanbul-lib-report","description":" This library provides TypeScript definitions for istanbul-lib-report. istanbul-lib-report is a library for creating reports from Istanbul coverage data."},{"name":"@types/file-saver","description":" FileSaver.js is a popular library written in JavaScript. It uses an MIT license. It's a library for saving files on the client-side. It is being used by millions of developers worldwide."},{"name":"metro-react-native-babel-preset","description":" This preset is for React Native applications. It uses an MIT license. It is a Babel preset for React Native applications. It is being used by millions of developers worldwide."},{"name":"stylelint-config-standard","description":" stylelint-config-standard is a popular shareable config for Stylelint. It uses an MIT license."},{"name":"@babel/plugin-proposal-pipeline-operator","description":" The Babel plugin proposal pipeline operator transforms pipeline operator into call expressions. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"apollo-server-express","description":" Apollo Server Express is a production-ready Node.js GraphQL server for Express. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"webdriverio","description":" WebdriverIO is a next-generation browser and mobile automation test framework for Node.js. It uses an MIT license. It is a fast, simple, and extensible framework that makes automated testing of modern web applications easy."},{"name":"@babel/plugin-proposal-pipeline-operator","description":" @babel/plugin-proposal-pipeline-operator is a Babel plugin that transforms pipeline operator into call expressions. It uses an MIT license."},{"name":"serverless","description":" Serverless is a popular framework used to build serverless architectures. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"firebase","description":" Firebase is a popular JavaScript library for web and Node.js development. It uses an Apache-2.0 license. It provides a flexible, scalable, and real-time database for your web or Node.js application."},{"name":"prettier-eslint","description":" prettier-eslint is a popular tool written in JavaScript that uses an MIT license. It formats your JavaScript code using prettier followed by eslint --fix. It is being used by millions of developers worldwide."},{"name":"urijs","description":" URI.js is a popular library written in JavaScript. It uses an MIT license. It is a lightweight library for working with URLs. It is being used by millions of developers worldwide."},{"name":"@storybook/cli","description":" The Storybook CLI is the easiest method of adding storybook to your projects. It uses an MIT license. It's a command line interface for storybook. You can use it to create and manage your storybook projects."},{"name":"@types/estree","description":" @types/estree is a TypeScript definition file that provides types for the estree JavaScript AST specification."},{"name":"@types/ioredis","description":" @types/ioredis is a TypeScript definition file for ioredis. It uses an MIT license. ioredis is a popular Redis client written in JavaScript."},{"name":"@types/react-select","description":" This is a stub TypeScript definitions entry for react-select, which provides its own types definitions. This is useful for development, but is not required for production."},{"name":"@types/redis","description":" @types/redis is a popular library that provides its own types definitions for the redis database. It uses an MIT license."},{"name":"jest-expo","description":" Jest-Expo is a Jest preset to painlessly test your Expo / React Native apps. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"gatsby-image","description":" gatsby-image is a React component that provides a simple way to load and display images with optional support for the blur-up effect. It uses an MIT license."},{"name":"babel-preset-gatsby-package","description":" Babel preset for internal Gatsby packages. This preset is used for our internal packages. If you're looking for the preset a **Gatsby Site** can use, please refer to [babel-preset-gatsby](https://github.com/gatsbyjs/gatsby/blob/master/packages/babel-preset-gatsby/README.md)."},{"name":"codelyzer","description":" Codelyzer is a linting tool for Angular applications. It follows the angular.io/styleguide. It is released under the MIT license."},{"name":"case-sensitive-paths-webpack-plugin","description":" This Webpack plugin enforces module path case sensitivity in Webpack. It is being used by millions of developers worldwide."},{"name":"@vue/test-utils","description":" @vue/test-utils is a set of utility functions that makes testing Vue components easier. It is released under the MIT license."},{"name":"supports-color","description":" Supports-color is a popular library written in JavaScript. It uses an MIT license. It's a library for detecting whether a terminal supports color. It is being used by millions of developers worldwide."},{"name":"safe-buffer","description":" Safe Buffer is a Node.js API that provides a safer way to work with buffers. It is MIT licensed."},{"name":"color-convert","description":" Plain color conversion functions. Converts colors between various color models.\n\nProject name: express\nWhat it does: Express is a fast, unopinionated, minimalist web framework for Node.js\nLicense: MIT\nDescription: Express is a fast, unopinionated, minimalist web framework for Node.js. It is used by millions of developers worldwide."},{"name":"boxen","description":" Boxen is a simple tool that allows you to create boxes in the terminal. It is released under the MIT license."},{"name":"crypto-random-string","description":" crypto-random-string is a popular library written in JavaScript. It uses an MIT license. It generates cryptographically strong random strings. It is being used by millions of developers worldwide."},{"name":"pump","description":" Pump is a small library that lets you pipe streams together and close all of them if one of them closes. It's useful for working with streams that may close unexpectedly, such as when using the request library to make HTTP requests."},{"name":"vinyl","description":" Vinyl is a virtual file format. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"estraverse","description":" Estraverse is a library that provides ECMAScript JS AST traversal functions. It uses a BSD-2-Clause license."},{"name":"mem","description":" Mem is a popular library written in JavaScript. It uses an MIT license. It's a memoize function library used to speed up consecutive function calls by caching the result of calls with identical input."},{"name":"prompt","description":" Prompt is a beautiful command-line prompt for node.js. It is released under the MIT license."},{"name":"@babel/helper-builder-react-jsx","description":" @babel/helper-builder-react-jsx is a helper function that helps build react jsx. It is released under the MIT license."},{"name":"npm-run-all","description":" npm-run-all is a command line tool that allows you to run multiple npm scripts in parallel or sequential. It is being used by millions of developers worldwide."},{"name":"webpack-hot-middleware","description":" webpack-hot-middleware is a plugin for webpack that allows hot reloading of modules. This is useful for development, where you can update modules without having to restart your server."},{"name":"semantic-ui-react","description":" Semantic-UI-React is the official Semantic-UI-React integration. It uses an MIT license. It allows developers to use the Semantic-UI-React components in their React applications."},{"name":"safe-buffer","description":" Safe Buffer is a popular library written in JavaScript. It uses an MIT license. It's a library that provides a safer Node.js Buffer API."},{"name":"supports-color","description":" This is a utility for detecting whether a terminal supports color. It is published under the MIT license."},{"name":"boxen","description":" Boxen is a command-line utility that allows you to create boxes in the terminal. It is released under the MIT license."},{"name":"mem","description":" Mem is a small JavaScript library that allows you to memoize functions. It uses an MIT license."},{"name":"crypto-random-string","description":" Crypto-random-string is a popular library written in JavaScript. It uses an MIT license. It generates cryptographically strong random strings."},{"name":"pump","description":" Pump is a small library that lets you pipe streams together and close all of them if one of them closes. It's written in JavaScript and uses an MIT license."},{"name":"vinyl","description":" Vinyl is a JavaScript library that provides a virtual file format. It is used for creating and working with virtual files."},{"name":"estraverse","description":" estraverse is a popular library written in JavaScript. It uses a BSD-2-Clause license. It is a tool for traversing ECMAScript JS ASTs. It is being used by millions of developers worldwide."},{"name":"semantic-ui-react","description":" Semantic-UI-React is the official Semantic-UI-React integration. Semantic-UI is a development framework that helps create beautiful, responsive layouts using human-friendly HTML. Semantic-UI-React is a React integration for Semantic-UI."},{"name":"aws4","description":" AWS4 is a popular library written in JavaScript. It uses an MIT license. It's a library for signing and preparing requests using AWS Signature Version 4. It is being used by millions of developers worldwide."},{"name":"lodash.kebabcase","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The lodash method `_.kebabCase` is exported as a module. It is used to convert strings to kebab case."},{"name":"parse5","description":" Parse5 is a popular HTML parser written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"normalize-url","description":" Normalize a URL is a library written in JavaScript that is used to normalize a URL. It uses an MIT license."},{"name":"@babel/plugin-transform-react-jsx-self","description":" This plugin adds a __self prop to all JSX Elements. This is helpful for library authors who want to add a self-prop to their components without having to add it manually."},{"name":"@testing-library/react","description":" @testing-library/react is a popular React testing library that uses an MIT license. It is simple and complete, and encourages good testing practices. It is being used by millions of developers worldwide."},{"name":"@stencil/core","description":" @stencil/core is a compiler for web components and progressive web apps. It uses an MIT license. @stencil/core is being used by millions of developers worldwide."},{"name":"clipboard","description":" Clipboard.js is a modern copy to clipboard library. It uses an MIT license. It is just 2kb in size. It is being used by millions of developers worldwide."},{"name":"prompts","description":" Prompts is a lightweight, beautiful and user-friendly prompts library. It is being used by developers all over the world."},{"name":"shelljs","description":" ShellJS is a portable Unix shell commands for Node.js. It uses a BSD-3-Clause license. It is being used by millions of developers worldwide."},{"name":"locate-path","description":" Locate-path is a small library that helps you find the first path that exists on disk of multiple paths. It is released under the MIT license."},{"name":"ua-parser-js","description":" ua-parser-js is a JavaScript library that detects Browser, Engine, OS, CPU, and Device type/model from User-Agent data. It supports browser & node.js environment."},{"name":"@types/babel__generator","description":" @types/babel__generator is a TypeScript definition file for @babel/generator. @babel/generator is a popular library written in JavaScript that uses an MIT license."},{"name":"normalize-package-data","description":" Normalize-package-data is a popular library written in JavaScript. It uses a BSD-2-Clause license. It's a library for normalizing data that can be found in package.json files. It is being used by millions of developers worldwide."},{"name":"write-file-atomic","description":" Write files in an atomic fashion w/configurable ownership. This is a Node.js module. It is being used by millions of developers worldwide."},{"name":"immer","description":" Immer is a popular library written in JavaScript. It uses an MIT license. It's a library that allows you to create your next immutable state by mutating the current one. It is being used by millions of developers worldwide."},{"name":"@angular/elements","description":" Angular Elements is a library for using Angular Components as Custom Elements. It is released under the MIT license."},{"name":"@vue/babel-preset-app","description":" @vue/babel-preset-app is a babel-preset-app for vue-cli. It uses an MIT license. It is a popular library written in JavaScript. It is being used by millions of developers worldwide."},{"name":"@vue/cli-plugin-typescript","description":" This plugin adds support for TypeScript to the vue-cli. It uses an MIT license. This plugin is very popular and is used by millions of developers worldwide."},{"name":"@types/istanbul-lib-coverage","description":" @types/istanbul-lib-coverage is a TypeScript definition file for istanbul-lib-coverage. istanbul-lib-coverage is a library for instrumenting code to generate coverage reports. It is used by many tools, including Istanbul, and is widely considered the standard for coverage reports."},{"name":"sockjs-client","description":" SockJS-client is a browser JavaScript library that provides a WebSocket-like object. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"jest-runtime","description":" Jest is a JavaScript testing framework. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"ci-info","description":" ci-info is a command line tool that retrieves information about the current Continuous Integration environment. It is useful for debugging and troubleshooting CI builds. It is released under the MIT license."},{"name":"http-errors","description":" http-errors is a popular library written in JavaScript. It uses an MIT license. It's a library for creating HTTP error objects. It is being used by millions of developers worldwide."},{"name":"http-signature","description":" The http-signature library is a reference implementation of Joyent's HTTP Signature scheme. It uses an MIT license. The library is written in JavaScript and is available on GitHub."},{"name":"@types/jsdom","description":" @types/jsdom is a TypeScript definitions file that provides TypeScript definitions for the jsdom library. It is released under the MIT license."},{"name":"babel-helper-builder-binary-assignment-operator-visitor","description":" Babel is a JavaScript compiler. This helper function builds binary assignment operator visitors. It is released under the MIT license."},{"name":"babel-helper-replace-supers","description":" Babel is a JavaScript compiler. This helper function helps to replace supers. It is released under the MIT license."},{"name":"babel-plugin-transform-export-extensions","description":" Babel is a JavaScript compiler. This plugin compiles export extensions to ES2015. It uses an MIT license."},{"name":"eslint-plugin-jest","description":" This plugin provides ESLint rules for Jest. It uses an MIT license. It is a popular plugin used by millions of developers worldwide."},{"name":"babel-plugin-styled-components","description":" Babel plugin styled-components is a plugin that adds support for debugging and server-side rendering to styled-components. It uses an MIT license."},{"name":"@storybook/addon-backgrounds","description":" @storybook/addon-backgrounds is a popular library written in JavaScript. It uses an MIT license. It's a library that allows you to switch backgrounds to view components in different settings. It is being used by millions of developers worldwide."},{"name":"@storybook/theming","description":" @storybook/theming is a library for building storybook components. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/ejs","description":" @types/ejs is a TypeScript definition file for the ejs templating language. It uses an MIT license."},{"name":"@types/yeoman-generator","description":" @types/yeoman-generator is a TypeScript definition file for yeoman-generator. It uses an MIT license. This library is helpful for developers who are using TypeScript with yeoman-generator."},{"name":"@types/express-session","description":" @types/express-session is a TypeScript definition for express-session. It uses an MIT license. It provides TypeScript definitions for express-session."},{"name":"@types/sinon-chai","description":" @types/sinon-chai is a TypeScript definition file for sinon-chai. It uses an MIT license. Sinon-chai is a popular library for assertion checking in TypeScript."},{"name":"pixi.js","description":" PixiJS is a fast and lightweight 2D library that uses WebGL for rendering. It is being used by millions of developers worldwide."},{"name":"@ionic/angular","description":" @ionic/angular is a popular library written in Angular. It uses an MIT license. It's a library for building mobile applications using Angular. It is being used by millions of developers worldwide."},{"name":"@types/bluebird","description":" @types/bluebird is a TypeScript definition file for bluebird. It uses an MIT license. This library is used for TypeScript development."},{"name":"grunt-contrib-clean","description":" Grunt-contrib-clean is a popular Grunt plugin that helps you clean files and folders. It uses an MIT license."},{"name":"lodash.clone","description":" The lodash method `_.clone` exported as a module. It is used to create a shallow clone of a value. It is being used by millions of developers worldwide."},{"name":"lodash.pick","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The `_.pick` method allows you to extract properties from an object."},{"name":"gulp-load-plugins","description":" gulp-load-plugins is a popular plugin written in JavaScript. It uses an MIT license. It automatically loads any gulp plugins in your package.json. It is being used by millions of developers worldwide."},{"name":"babel-plugin-transform-decorators-legacy","description":" Babel is a popular JavaScript compiler. This plugin allows you to use the old decorator behavior from Babel 5. It uses an MIT license."},{"name":"backbone","description":" Backbone is a popular library written in JavaScript. It uses an MIT license. It gives your JS App some Backbone with Models, Views, Collections, and Events. It is being used by millions of developers worldwide."},{"name":"needle","description":" Needle is a fast and lightweight HTTP client written in JavaScript. It is licensed under the MIT license. It is being used by millions of developers worldwide."},{"name":"postcss-scss","description":" postcss-scss is a parser for PostCSS that enables you to use SCSS syntax in your PostCSS files. It uses an MIT license."},{"name":"postcss-url","description":" postcss-url is a popular plugin written for the PostCSS library. It uses an MIT license. It's a plugin that rebases or inlines on url(). It is being used by millions of developers worldwide."},{"name":"interpret","description":" Interpret is a dictionary of file extensions and associated module loaders. It uses an MIT license. It is used to associate file extensions with the corresponding module loader."},{"name":"sinon-chai","description":" Sinon-chai is a popular library that extends Chai with assertions for the Sinon.JS mocking framework. It is released under the BSD-2-Clause license."},{"name":"@babel/plugin-transform-react-jsx-source","description":" @babel/plugin-transform-react-jsx-source is a Babel plugin that adds a __source prop to all JSX Elements. This is helpful for debugging React applications. It uses an MIT license."},{"name":"interpret","description":" Interpret is a dictionary of file extensions and associated module loaders. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"grunt-contrib-clean","description":" Grunt-contrib-clean is a plugin for Grunt that allows you to clean files and folders. It uses an MIT license."},{"name":"gulp-load-plugins","description":" gulp-load-plugins is a popular plugin written in JavaScript. It uses an MIT license. It automatically loads any gulp plugins in your package.json. It is being used by millions of developers worldwide."},{"name":"lodash.pick","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The `_.pick` method creates an object composed of the picked object properties."},{"name":"lodash.clone","description":" Lodash is a popular utility library written in JavaScript. It uses an MIT license. The lodash method `_.clone` exported as a module. It is being used by millions of developers worldwide."},{"name":"ansi-colors","description":" ansi-colors is a popular library written in JavaScript. It uses an MIT license. It's a drop-in replacement for chalk, kleur and turbocolor that is faster and doesn't have any dependencies or rendering bugs."},{"name":"ignore","description":" Ignore is a popular and useful tool for managing and filtering .gitignore rules. It is released under the MIT license. It is used by millions of developers worldwide."},{"name":"es-abstract","description":" Es-abstract is a library that contains ECMAScript spec abstract operations. It is released under the MIT license."},{"name":"ansi-regex","description":" ansi-regex is a popular regular expression written in JavaScript. It uses an MIT license. It matches ANSI escape codes."},{"name":"prelude-ls","description":" prelude.ls is a utility library written in LiveScript. It uses an MIT license. It is powerful and flexible. Almost all of its functions are curried. It is being used by millions of developers worldwide."},{"name":"fast-levenshtein","description":" Fast-levenshtein is a popular library written in JavaScript. It uses an MIT license. It's an efficient implementation of Levenshtein algorithm with locale-specific collator support. It is being used by millions of developers worldwide."},{"name":"emoji-regex","description":" emoji-regex is a popular library written in JavaScript. It uses an MIT license. It's a regular expression to match all Emoji-only symbols as per the Unicode Standard. It is being used by millions of developers worldwide."},{"name":"optimist","description":" Optimist is a light-weight option parsing library written in JavaScript. It uses an MIT/X11 license. It is being used by millions of developers worldwide."},{"name":"he","description":" he is a robust HTML entities encoder/decoder written in JavaScript. It uses an MIT license. It has full Unicode support and is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-function-bind","description":" @babel/plugin-proposal-function-bind is a Babel plugin that compiles the function bind operator to ES5. It uses an MIT license."},{"name":"readdirp","description":" readdirp is a recursive version of fs.readdir with a streaming API. It is being used by millions of developers worldwide."},{"name":"lodash.mapvalues","description":" The lodash method `_.mapValues` exported as a module. It uses an MIT license. This method is used for creating an object with the same values as `object` and with `iteratee` invoked for each value."},{"name":"@babel/plugin-syntax-decorators","description":" Babel is a popular JavaScript compiler. This plugin allows parsing of decorators, which is a popular way to add behavior to JavaScript classes. It uses an MIT license."},{"name":"grunt-contrib-uglify","description":" Grunt plugin to minify JavaScript files using UglifyJS. It uses an MIT license."},{"name":"foundation-sites","description":" Foundation is a popular front-end framework written in JavaScript. It uses an MIT license. It's the most advanced responsive front-end framework in the world. Foundation is being used by millions of developers worldwide."},{"name":"mysql","description":" MySQL is a popular database management system. It is written in C and C++. It is used by millions of developers worldwide."},{"name":"gulp-util","description":" gulp-util is a utility library for gulp plugins. It uses an MIT license. It provides utility functions for gulp plugins, including logging, colors, and error handling."},{"name":"angular-in-memory-web-api","description":" Angular in-memory-web-api is an in-memory web api for Angular demos and tests. It uses an MIT license."},{"name":"jsdoc","description":" JSDoc is a popular API documentation generator written in JavaScript. It uses an Apache-2.0 license. It is being used by millions of developers worldwide."},{"name":"tsconfig-paths","description":" tsconfig-paths is a popular library written in TypeScript. It uses an MIT license. It's a library for loading node modules according to tsconfig paths, in run-time or via API. It is being used by millions of developers worldwide."},{"name":"cli-spinners","description":" cli-spinners is a library that provides spinners for use in the terminal. It is released under the MIT license."},{"name":"vue-class-component","description":" vue-class-component is a decorator for Vue components written in ES201X/TypeScript. It uses an MIT license. It allows you to create Vue components using an ES201X/TypeScript class."},{"name":"js-cookie","description":" JS-Cookie is a simple, lightweight JavaScript API for handling cookies. It is being used by millions of developers worldwide."},{"name":"@types/babel__template","description":" @types/babel__template is a TypeScript definition file for @babel/template. @babel/template is a popular library written in JavaScript. It uses an MIT license."},{"name":"@types/babel__template","description":" @types/babel__template is a TypeScript definition file for @babel/template. @babel/template is a popular library written in JavaScript. It uses an MIT license."},{"name":"file-type","description":" file-type is a JavaScript library that detects the file type of a Buffer/Uint8Array/ArrayBuffer. It uses an MIT license."},{"name":"sqlite3","description":" SQLite3 is a popular database written in C. It uses a BSD-3-Clause license. It's asynchronous, non-blocking bindings for SQLite3. It is being used by millions of developers worldwide."},{"name":"jest-docblock","description":" `jest-docblock` is a package that can extract and parse a specially-formatted comment called a \"docblock\" at the top of a file. It is being used by millions of developers worldwide."},{"name":"koa-router","description":" Koa Router is a middleware library written in JavaScript. It uses an MIT license. It's a router middleware for koa. It is being used by millions of developers worldwide."},{"name":"pkg-dir","description":" pkg-dir is a popular Node.js package that helps you find the root directory of a project or npm package. It uses an MIT license."},{"name":"jest-watcher","description":" Jest is a popular testing library written in JavaScript. It uses an MIT license. It is delightful, fast and has an extensive feature set. It is being used by millions of developers worldwide."},{"name":"flatted","description":" Flatted is a super light and fast circular JSON parser. It uses an ISC license. It's super light and fast, and it's able to parse circular JSON structures. It's being used by millions of developers worldwide."},{"name":"@types/angular","description":" @types/angular is a TypeScript definition file for AngularJS. It uses an MIT license. This library is used by TypeScript developers to get type information for AngularJS."},{"name":"@types/lodash.debounce","description":" @types/lodash.debounce is a TypeScript definition file for lodash.debounce. It uses an MIT license."},{"name":"@types/nodemailer","description":" @types/nodemailer is a library that provides type definitions for the Nodemailer library. It uses an MIT license."},{"name":"jquery-ui","description":" jQuery UI is a popular library written in JavaScript. It uses an MIT license. It is a curated set of user interface interactions, effects, widgets, and themes built on top of the jQuery JavaScript Library. It is being used by millions of developers worldwide."},{"name":"@types/cheerio","description":" @types/cheerio is a library that provides TypeScript definitions for Cheerio. Cheerio is a popular library written in JavaScript that uses an MIT license."},{"name":"babel-helper-explode-assignable-expression","description":" Babel is a popular JavaScript library. It uses an MIT license. This helper function helps to explode an assignable expression."},{"name":"babel-helper-define-map","description":" Babel is a popular JavaScript transpiler. This helper function allows you to define a map. It is being used by millions of developers worldwide."},{"name":"babel-helper-hoist-variables","description":" Babel is a popular JavaScript library. This helper function helps to hoist variables."},{"name":"babel-helper-remap-async-to-generator","description":" babel-helper-remap-async-to-generator is a helper function that remaps async functions to generators. It uses an MIT license."},{"name":"lit-element","description":" LitElement is a simple base class for creating fast, lightweight web components. It is being used by millions of developers worldwide."},{"name":"@typescript-eslint/experimental-utils","description":" @typescript-eslint/experimental-utils is a library that provides utilities for working with TypeScript and ESLint together. It is released under the MIT license."},{"name":"semantic-release","description":" Semantic Release is a tool that automates the process of publishing software packages. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"serve","description":" Serve is a simple, zero-configuration command-line HTTP server. It is written in Go and released under an MIT license."},{"name":"@storybook/addon-info","description":" The @storybook/addon-info addon is a Storybook addon that allows you to show additional information for your stories. It is released under the MIT license."},{"name":"@storybook/addon-a11y","description":" @storybook/addon-a11y is an addon for Storybook that allows you to test compliance with web accessibility standards. It uses an MIT license."},{"name":"@types/lru-cache","description":" @types/lru-cache is a TypeScript definitions entry for lru-cache. It provides its own types definitions. It is released under an MIT license."},{"name":"@types/mime","description":" @types/mime is a TypeScript definition for mime. It uses an MIT license."},{"name":"@types/tar","description":" @types/tar is a TypeScript definition file for the tar library. It uses an MIT license."},{"name":"@types/babel-core","description":" @types/babel-core is a TypeScript definition file for the popular Babel JavaScript library. It uses an MIT license."},{"name":"@types/power-assert","description":" @types/power-assert is a TypeScript definition file that enables TypeScript to understand the power-assert library. It uses an MIT license."},{"name":"@types/sequelize","description":" TypeScript definitions for Sequelize. This library provides type definitions for Sequelize. It is released under an MIT license."},{"name":"@types/bootstrap","description":" @types/bootstrap is a TypeScript definition file for the popular Bootstrap library. It uses an MIT license. This definition file allows TypeScript developers to use Bootstrap with type safety."},{"name":"react-native-elements","description":" React Native Elements is a UI toolkit for React Native. It is a popular library written in JavaScript. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"gatsby-plugin-mdx","description":" gatsby-plugin-mdx is a plugin for Gatsby that allows you to use MDX to write your content. It uses an MIT license."},{"name":"cookie","description":" Cookie is a popular library written in JavaScript. It uses an MIT license. It's a library for parsing and serializing HTTP cookies."},{"name":"crypto-js","description":" CryptoJS is a JavaScript library of crypto standards. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"chai-as-promised","description":" Chai is a popular assertion library for JavaScript. Chai-as-promised extends Chai with assertions about promises. It uses the WTFPL license, which is a permissive license that allows you to do whatever you want with the software."},{"name":"dateformat","description":" DateFormat is a node.js package for Steven Levithan's excellent dateFormat() function. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"gulp-notify","description":" gulp-notify is a gulp plugin that uses the node-notifier module to send messages based on Vinyl Files or Errors. It is licensed under the MIT license."},{"name":"lodash.mergewith","description":" Lodash is a JavaScript utility library that provides many useful methods. One of these methods is `_.mergeWith`. This method is exported as a module in this project. It is licensed under the MIT license."},{"name":"laravel-mix","description":" Laravel Mix is a popular tool written in PHP. It uses an MIT license. It provides an easy way to use the power of webpack in Laravel applications. It is being used by millions of developers worldwide."},{"name":"lodash.isequal","description":" Lodash is a popular library written in JavaScript. It uses an MIT license. It is a utility library that provides many helper functions. One of its popular methods is `_.isEqual`, which is exported as a module in this project."},{"name":"neo-async","description":" Neo-Async is a drop-in replacement for Async, it almost fully covers its functionality and runs faster. It is being used by millions of developers worldwide."},{"name":"jest-react-native","description":" Jest React Native is a library for testing React Native components. It uses a BSD-3-Clause license."},{"name":"js-base64","description":" js-base64 is a popular library written in JavaScript. It uses a BSD-3-Clause license. It's a Base64 transcoder in pure-JS. It is being used by millions of developers worldwide."},{"name":"jsdoc-to-markdown","description":" Jsdoc-to-markdown is a popular library that generates markdown API documentation from jsdoc annotated source code. It is being used by millions of developers worldwide."},{"name":"eslint-plugin-flowtype","description":" This plugin provides Flowtype-specific linting rules for ESLint. It uses a BSD-3-Clause license. It is a popular plugin used by many developers to ensure their code conforms to the Flowtype style guide."},{"name":"postcss-load-config","description":" postcss-load-config is a PostCSS plugin that allows you to autoload configs for PostCSS. It's MIT licensed."},{"name":"pretty-bytes","description":" Pretty-bytes is a utility library that converts bytes into a human readable string. It uses an MIT license."},{"name":"xo","description":" xo is a popular JavaScript linter with a great default configuration. It uses an MIT license."},{"name":"ansi-styles","description":" ansi-styles is a library that provides ANSI escape codes for styling strings in the terminal. It is released under the MIT license."},{"name":"jsesc","description":" jsesc is a JavaScript library that allows you to stringify data in a safe and ASCII-safe manner. It is being used by millions of developers worldwide."},{"name":"base64-js","description":" Base64-js is a popular library written in JavaScript. It uses an MIT license. It's a Base64 encoding/decoding library. It is being used by millions of developers worldwide."},{"name":"fast-deep-equal","description":" Fast deep equal is a popular library written in JavaScript. It uses an MIT license. It is a fast, lightweight, and simple library for deep equality comparisons."},{"name":"source-map","description":" Source map is a library that generates and consumes source maps. It is licensed under the BSD-3-Clause license."},{"name":"event-stream","description":" Event-Stream is a popular JavaScript library for working with streams of events. It is released under the MIT license. Event-Stream is used by millions of developers worldwide."},{"name":"jest-junit","description":" Jest is a popular JavaScript testing tool. Jest-JUnit is a reporter that generates JUnit XML files. It is released under the Apache-2.0 license."},{"name":"sax","description":" Sax is a popular library written in JavaScript. It uses an ISC license. It is an evented streaming XML parser. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-syntax-json-strings","description":" This Babel plugin allows parsing of the U+2028 LINE SEPARATOR and U+2029 PARAGRAPH SEPARATOR in JS strings. It uses an MIT license."},{"name":"url-parse","description":"\n\nUrl-parse is a small footprint URL parser that works seamlessly across Node.js and browser environments. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"gulp-minify-css","description":" gulp-minify-css is a plugin for gulp that minifies css with clean-css. It uses an MIT license."},{"name":"@babel/plugin-proposal-private-methods","description":" This plugin transforms private class methods. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@babel/plugin-proposal-private-methods","description":" @babel/plugin-proposal-private-methods is a Babel plugin that transforms private class methods. It uses an MIT license."},{"name":"hosted-git-info","description":" Hosted-git-info is a library that provides metadata and conversions from repository urls for GitHub, Bitbucket and GitLab. It is released under the ISC license."},{"name":"is-plain-obj","description":" is-plain-obj is a popular library written in JavaScript. It uses an MIT license. It is a utility for checking if a value is a plain object."},{"name":"@babel/plugin-proposal-do-expressions","description":" Babel is a popular JavaScript compiler. This plugin allows Babel to compile do expressions to ES5. It uses an MIT license."},{"name":"@babel/helper-call-delegate","description":" @babel/helper-call-delegate is a helper function that makes it easy to call delegate functions. It uses an MIT license."},{"name":"@types/luxon","description":" @types/luxon is a TypeScript definition file for the luxon library. It uses an MIT license."},{"name":"@vue/cli-plugin-unit-jest","description":" This plugin is a unit-jest plugin for vue-cli. It uses an MIT license. It is a plugin that allows you to run jest unit tests on your Vue.js project."},{"name":"@types/invariant","description":" @types/invariant is a library that provides TypeScript definitions for invariant. It uses an MIT license."},{"name":"@types/js-yaml","description":" @types/js-yaml is a TypeScript definition file for js-yaml. It uses an MIT license."},{"name":"angular-messages","description":" Angular-messages is an AngularJS module that provides enhanced support for displaying messages within templates. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"boom","description":" Boom is a popular library written in JavaScript. It uses a BSD-3-Clause license. It's a HTTP-friendly error objects library. It is being used by millions of developers worldwide."},{"name":"@angular-devkit/architect","description":" The Angular Build Facade is a library that provides an easy way to build Angular applications. It uses an MIT license."},{"name":"@angular-devkit/core","description":" The Angular DevKit - Core Utility Library is a popular library written in TypeScript. It uses an MIT license. It provides a core set of utilities for working with Angular projects."},{"name":"jest-message-util","description":" Jest is a popular JavaScript testing library. Jest Message Util is a library that provides utilities for working with Jest messages. It is released under the MIT license."},{"name":"jest-snapshot","description":" Jest Snapshot is a library for snapshot testing React components. It is released under the MIT license."},{"name":"tough-cookie","description":" tough-cookie is a node.js library that provides an RFC6265-compliant implementation of cookies and cookie jars. It is released under a BSD-3-Clause license."},{"name":"babel-preset-react-native","description":" Babel preset for React Native applications. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@types/node-sass","description":" @types/node-sass is a TypeScript definition file for node-sass. It uses an MIT license."},{"name":"@types/js-cookie","description":" @types/js-cookie is a TypeScript definition file for js-cookie. It uses an MIT license. This library is used for typechecking when using js-cookie."},{"name":"@types/d3","description":" The @types/d3 package contains TypeScript definitions for the D3JS d3 standard bundle. It uses an MIT license. This package enables developers to use TypeScript with the popular D3JS library."},{"name":"babel-helper-regex","description":" Babel is a popular JavaScript compiler. This helper function allows checking for literal regular expressions. It is released under the MIT license."},{"name":"babel-helper-optimise-call-expression","description":" Babel helper function to optimise call expression. It uses an MIT license."},{"name":"babel-helper-function-name","description":" Babel is a JavaScript library that helps developers write code that is compatible with different browsers. This helper function helps developers change the property 'name' of every function."},{"name":"babel-preset-es2017","description":" Babel preset for all es2017 plugins. It uses an MIT license. It is a popular library written in JavaScript. It is being used by millions of developers worldwide."},{"name":"redux-saga","description":" Redux-saga is a library that helps you to manage side effects in your Redux application. It uses an MIT license."},{"name":"vue-server-renderer","description":" Vue-server-renderer is a server renderer for Vue 2.0. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"@fortawesome/fontawesome-free","description":" Font Awesome is a popular font, CSS, and SVG framework. It is used by millions of developers worldwide. It is released under the CC-BY-4.0 license, OFL-1.1 license, and MIT license."},{"name":"@storybook/addon-viewport","description":" @storybook/addon-viewport is a popular library written in JavaScript. It uses an MIT license. It's a library for building responsive components by adjusting Storybook's viewport size and orientation. It is being used by millions of developers worldwide."},{"name":"@types/faker","description":" @types/faker is a stub TypeScript definitions entry for faker. It provides its own types definitions. It is licensed under the MIT license."},{"name":"@types/update-notifier","description":" @types/update-notifier is a TypeScript definition file for update-notifier. It uses an MIT license. Update-notifier is a popular library that helps you keep your software dependencies up-to-date."},{"name":"log-update","description":" Log-update is a popular library written in JavaScript. It uses an MIT license. It is used for logging by overwriting the previous output in the terminal. It is being used by millions of developers worldwide."},{"name":"eslint-plugin-mocha","description":" eslint-plugin-mocha is an ESLint plugin that provides rules for mocha. It is released under the MIT license."},{"name":"recharts","description":" Recharts is a React chart library that lets developers create charts using a declarative syntax. It is open source and released under the MIT license."},{"name":"material-design-icons","description":" Material Design icons are a set of icons that were designed by Google. They are open source and released under an Apache-2.0 license."},{"name":"pm2","description":" PM2 is a production process manager for Node.JS applications with a built-in load balancer. It is used by millions of developers worldwide and is open source under the AGPL-3.0 license."},{"name":"react-draggable","description":" React draggable is a popular library that allows you to drag and drop elements on a page. It is being used by millions of developers worldwide."},{"name":"bcrypt","description":" bcrypt is a popular library written in JavaScript. It uses an MIT license. It's a library for NodeJS that allows you to hash passwords."},{"name":"combined-stream","description":" Combined-Stream is a popular module written in JavaScript. It uses an MIT license. It is a stream that emits multiple other streams one after another. It is being used by millions of developers worldwide."},{"name":"address","description":" Address is a small utility written in JavaScript that gets your machine's IP, MAC and DNS servers. It is released under the MIT license."},{"name":"lodash.uniqby","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. The lodash method `_.uniqBy` exported as a module. It is being used by millions of developers worldwide."},{"name":"jsdom-global","description":" Jsdom-global is a library that enables DOM in Node.js. It uses an MIT license. It is being used by millions of developers worldwide."},{"name":"lodash.isfunction","description":" Lodash is a popular JavaScript utility library. It uses an MIT license. This module lets you check if a value is a function."}]