/*!-----------------------------------------------------------
 * Copyright (c) Microsoft Corporation. All rights reserved.
 * Version: 0.5.3(793ede49d53dba79d39e52205f16321278f5183c)
 * Released under the MIT license
 * https://github.com/Microsoft/vscode/blob/master/LICENSE.txt
 *-----------------------------------------------------------*/

define("vs/base/common/worker/simpleWorker.nls.ja", {
	"vs/base/common/errors": [
		"{0}。エラー コード: {1}",
		"アクセス許可が拒否されました (HTTP {0})",
		"アクセス許可が拒否されました",
		"{0} (HTTP {1}: {2})",
		"{0} (HTTP {1})",
		"不明な接続エラー ({0})",
		"不明な接続エラーが発生しました。インターネット接続が切れたか、接続先のサーバーがオフラインです。",
		"{0}: {1}",
		"不明なエラーが発生しました。ログで詳細を確認してください。",
		"システム エラーが発生しました ({0})",
		"不明なエラーが発生しました。ログで詳細を確認してください。",
		"{0} (合計 {1} エラー)",
		"不明なエラーが発生しました。ログで詳細を確認してください。",
		"実装されていません",
		"無効な引数: {0}",
		"無効な引数",
		"無効な状態: {0}",
		"無効な状態",
		"必要なファイルを読み込みに失敗しました。インターネット接続が切れたか、接続先のサーバーがオフラインです。ブラウザーを更新して、もう一度やり直してください。",
		"必要なファイルの読み込みに失敗しました。アプリケーションを再起動してもう一度試してください。詳細: {0}",
	],
	"vs/base/common/keyCodes": [
		"Windows",
		"コントロール",
		"Shift",
		"Alt",
		"コマンド",
		"Windows",
		"Ctrl",
		"Shift",
		"Alt",
		"コマンド",
		"Windows",
	],
	"vs/base/common/severity": [
		"エラー",
		"警告",
		"情報",
	]
});