/*!-----------------------------------------------------------
 * Copyright (c) Microsoft Corporation. All rights reserved.
 * Version: 0.5.3(793ede49d53dba79d39e52205f16321278f5183c)
 * Released under the MIT license
 * https://github.com/Microsoft/vscode/blob/master/LICENSE.txt
 *-----------------------------------------------------------*/

define("vs/base/common/worker/simpleWorker.nls.ko", {
	"vs/base/common/errors": [
		"{0}. 오류 코드: {1}",
		"사용 권한이 거부되었습니다(HTTP {0}).",
		"사용 권한이 거부되었습니다.",
		"{0}(HTTP {1}: {2})",
		"{0}(HTTP {1})",
		"알 수 없는 연결 오류({0})",
		"알 수 없는 연결 오류가 발생했습니다. 인터넷에 연결되지 않았거나 연결된 서버가 오프라인 상태입니다.",
		"{0}: {1}",
		"알 수 없는 오류가 발생했습니다. 자세한 내용은 로그를 참조하세요.",
		"시스템 오류가 발생했습니다({0}).",
		"알 수 없는 오류가 발생했습니다. 자세한 내용은 로그를 참조하세요.",
		"{0}(총 {1}개의 오류)",
		"알 수 없는 오류가 발생했습니다. 자세한 내용은 로그를 참조하세요.",
		"구현 안 됨",
		"잘못된 인수: {0}",
		"잘못된 인수",
		"잘못된 상태: {0}",
		"잘못된 상태",
		"필요한 파일을 로드하지 못했습니다. 인터넷에 연결되지 않았거나 연결된 서버가 오프라인 상태입니다. 브라우저를 새로 고친 후 다시 시도해 보세요.",
		"필요한 파일을 로드하지 못했습니다. 응용 프로그램을 다시 시작하여 다시 시도하세요. 세부 정보: {0}",
	],
	"vs/base/common/keyCodes": [
		"Windows",
		"Ctrl",
		"Shift",
		"Alt",
		"명령",
		"Windows",
		"Ctrl",
		"Shift",
		"Alt",
		"명령",
		"Windows",
	],
	"vs/base/common/severity": [
		"오류",
		"경고",
		"정보",
	]
});